{
  "source": "PCG Workshop Database",
  "url": "https://www.pcgworkshop.com/database.php",
  "total_papers": 152,
  "years_covered": "2010-2025",
  "papers": [
    {
      "title": "Analysis of Uncertainty in Procedural Maps in Slay the Spire",
      "year": 2025,
      "authors": "Mahsa Bazzaz and Seth Cooper",
      "abstract": "This work investigates the role of uncertainty in Slay the Spire using an information-theoretic framework. Focusing on the entropy of game paths (which are based on procedurally-generated maps) we analyze how randomness influences player decision-making and success. By examining a dataset of 20,000 game runs, we quantify the entropy of paths taken by players and relate it with their outcomes and skill levels. The results show that victorious runs are associated with higher normalized entropy, suggesting more risk-taking. Additionally, higher-skill players tend to exhibit distinct patterns of risk-taking behavior in later game stages.",
      "keywords": "entropy, puzzle, slay the spire, uncertainty, risk-taking",
      "citation": "@inproceedings{bazzaz2025uncertainty,  title={Analysis of Uncertainty in Procedural Maps in Slay the Spire}, author={Mahsa Bazzaz and Seth Cooper}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Constraint Is All You Need: Optimization-Based 3D Level Generation with LLMs",
      "year": 2025,
      "authors": "Kaijie Xu and Clark Verbrugge",
      "abstract": "Procedural Content Generation (PCG) has long enabled efficient and varied game level creation. However, integrating high-level design intentions and game mechanics into complex 3D environments remains challenging. This paper introduces a comprehensive framework that transforms narrative-level descriptions into playable 3D game levels. First, Large Language Models (LLMs) parse natural language descriptions of game environments into a structured Game Level Description Language (GLDL), capturing essential spatial constraints. Next, we model level generation as a Facility Layout Optimization problem, ensuring that facility placements and configurations adhere to specified design criteria. Through comprehensive experiments, including automated constraint evaluations and agent-based simulations, our approach ensures both the feasibility and stability of the constraints extracted from textual descriptions. We confirm that the resulting game levels remain interactive, reasonable, and controllable to their original specifications.",
      "keywords": "procedural content generation, facility layout problem, level generation, large language models, game design",
      "citation": "@inproceedings{xu2025constraint,  title={Constraint Is All You Need: Optimization-Based 3D Level Generation with LLMs}, author={Kaijie Xu and Clark Verbrugge}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Conversational Interactions with Procedural Generators using Large Language Models",
      "year": 2025,
      "authors": "Jim Whitehead, Thomas Wessel, Blythe Chen, Raven Cruz-James, Luc Harnist, William Klunder, Justin Lam, Ethan Lin, Roman Luo, Hung Nguyen, Naitik Poddar, Shiva Ravinutula, Alejandro Montoreano, Logan Shehane, Yazmyn Sims, Jarod Spangler, Michelle Tan, and Zosia Trela",
      "abstract": "This paper explores the potential of Large Language Models (LLMs) to facilitate conversational natural language interactions to aid humans in mixed-initiative generation of game worlds. This paper explores the issues in creating a system that allows for rapid iteration in a turn-based user-LLM design software. We identify key research topics, including game world representation in LLMs, natural language-based world manipulation using function calls, and direct manipulation from processed LLM output. We successfully created a QA dataset to compare the accuracy of leading models using text, images, or both. Our findings highlight the potential of LLMs to assist in procedural content generation through enhanced natural language interaction and conversations while revealing the challenges of in-game world manipulation that warrant further research.",
      "keywords": "procedural content generation, large language models, natural language interaction, conversational interaction with procedural generators",
      "citation": "@inproceedings{whitehead2025conversational,  title={Conversational Interactions with Procedural Generators using Large Language Models}, author={Jim Whitehead and Thomas Wessel and Blythe Chen and Raven Cruz-James and Luc Harnist and William Klunder and Justin Lam and Ethan Lin and Roman Luo and Hung Nguyen and Naitik Poddar and Shiva Ravinutula and Alejandro Montoreano and Logan Shehane and Yazmyn Sims and Jarod Spangler and Michelle Tan and Zosia Trela}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Diverse Level Generation via Machine Learning of Quality Diversity",
      "year": 2025,
      "authors": "Konstantinos Sfikas, Antonios Liapis, and Georgios N. Yannakakis",
      "abstract": "Can we replicate the power of evolutionary algorithms in discovering good and diverse game content via generative machine learning (ML) techniques? This question could subvert current trends in procedural content generation (PCG) and beyond. By learning the behavior of quality-diversity (QD) evolutionary algorithms through ML, we stand to overcome the computational challenges inherent in QD search and ensure that the benefits of QD search are reproduced by efficient generative models. We introduce a novel, end-to-end methodology named Machine Learning of Quality Diversity (MLQD) which is executed in two steps. First, tailored QD evolution creates large and diverse training datasets from the ground up. Second, sophisticated ML architectures such as the Transformer learn the datasets? underlying distributions, resulting in generative models that can emulate QD search via stochastic inference. We test MLQD on the use-case of generating strategy game map sketches, a task characterized by stringent constraints and a multidimensional feature space. Our findings are promising, demonstrating that the Transformer architecture can capture both the diversity and the quality traits of the training sets, successfully reproducing the behavior of a range of tested QD algorithms. This marks a significant advancement in our quest to automate the creation of high-quality, diverse game content, pushing the boundaries of what is possible in PCG and generative AI at large.",
      "keywords": "procedural content generation, machine learning, novelty search, quality diversity, strategy maps",
      "citation": "@inproceedings{sfikas2025diverse,  title={Diverse Level Generation via Machine Learning of Quality Diversity}, author={Konstantinos Sfikas and Antonios Liapis and Georgios N. Yannakakis}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Exploring the Possibility Space of 1 Billion Spells",
      "year": 2025,
      "authors": "Oliver Withington",
      "abstract": "In this short paper we introduce the first version of a 'spell simulator' for 1 Billion Spells, an in development action game, and explore the simulator's utility for conducting large scale exploration and evaluation of that game's spell creation system. Using this simulator we conduct initial experiments to explore specific developer concerns about the game which would be challenging to explore with conventional playtesting. We argue that our initial exploration demonstrates the potential of this approach in evaluating content generation systems for games that have large player explorable possibility spaces.",
      "keywords": "procedural content generation, evaluation, games",
      "citation": "@inproceedings{withington2025spells,  title={Exploring the Possibility Space of 1 Billion Spells}, author={Oliver Withington}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Level Generation with Constrained Expressive Range",
      "year": 2025,
      "authors": "Mahsa Bazzaz and Seth Cooper",
      "abstract": "Expressive range analysis is a visualization-based technique used to evaluate the performance of generative models, particularly in game level generation. It typically employs two quantifiable metrics to position generated artifacts on a 2D plot, offering insight into how content is distributed within a defined metric space. In this work, we use the expressive range of a generator as the conceptual space of possible creations. Inspired by the quality diversity paradigm, we explore this space to generate levels. To do so, we use a constraint-based generator that systematically traverses and generates levels in this space. To train the constraint-based generator we use different tile patterns to learn from the initial example levels. We analyze how different patterns influence the exploration of the expressive range. Specifically, we compare the exploration process based on time, the number of successful and failed sample generations, and the overall interestingness of the generated levels. Unlike typical quality diversity approaches that rely on random generation and hope to get good coverage of the expressive range, this approach systematically traverses the grid ensuring more coverage. This helps create unique and interesting game levels while also improving our understanding of the generator?s strengths and limitations.",
      "keywords": "video games, pcg expressive range, constraint-based generation",
      "citation": "@inproceedings{bazzaz2025constrained,  title={Level Generation with Constrained Expressive Range}, author={Mahsa Bazzaz and Seth Cooper}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Maintenance in Procedural Level Design: Lessons from Ludoscope",
      "year": 2025,
      "authors": "Daria Protsenko, Joris Dormans, and Riemer van Rozen",
      "abstract": "Procedural level generation empowers level designers with tools for generating many levels from a single specification, while engineers maintain the level generator. Despite advances in procedural techniques, little is known about their impact on long-term system maintenance. We explore how Domain-Specific Languages (DSLs) can help improve procedural level design processes, and support maintenance by integrating level design sketches into generator-agnostic tools. This short paper examines the evolution of Ludoscope, a state-of-the-art level generator used in the games Unexplored 1 and 2. In over a decade, it has grown in complexity, with Unexplored 2?s generator now containing over 20K rewrite rules. We investigate how Ludomotion addressed maintenance challenges, and how this impacts procedural level design. Our approach combines: 1) a bottom-up analysis of Ludoscope; and 2) a top-down exploration of a generic DSL for ?level blueprints?. This paper contributes the first step and discusses ongoing work on a reusable framework for procedural level design. Our work takes a promising first step towards industrial-strength maintenance solutions.",
      "keywords": "procedural level design, sketches, feature modeling, roguelikes",
      "citation": "@inproceedings{protsenko2025maintenance,  title={Maintenance in Procedural Level Design: Lessons from Ludoscope}, author={Daria Protsenko and Joris Dormans and Riemer van Rozen}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Stuck in the Middle: Generating Levels without (or with) Softlocks",
      "year": 2025,
      "authors": "Seth Cooper and Mahsa Bazzaz",
      "abstract": "When generating game levels, it is desirable for them to be completable. Depending on the designer?s goals, it may also be desirable to generate levels without softlocks. A softlock is a situation where the player has not won or lost, but cannot make progress toward the goal, and is thus stuck (unless they reset, or possibly lose the level). In this work we present a constraint-based approach to generating 2D tile-based levels that are completable and do not have areas where the player can get stuck. The approach uses a constraint-based reachability categorization of locations during level generation. This categorization can be used to prevent softlocks by ensuring that all locations reachable going forward from the start of the level are also reachable going backward from the goal, unless they are sinks (areas where the player will inevitably lose the level, e.g. falling off the bottom). Using this approach, it is also possible to intentionally generate levels with softlocks and to repair levels to remove softlocks.",
      "keywords": "video games, procedural content generation, constraints, softlocks",
      "citation": "@inproceedings{cooper2025softlocks,  title={Stuck in the Middle: Generating Levels without (or with) Softlocks}, author={Seth Cooper and Mahsa Bazzaz}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "Towards Didactics-Driven Development of Educational Games",
      "year": 2025,
      "authors": "Anders Bouwer and Riemer van Rozen",
      "abstract": "Educational games offer an effective means to enhance interactive learning experiences. However, developing high quality educational games is difficult. In particular, integrating didactic goals into a game?s design, and verifying the learning outcomes is a complex iterative process. Due to a lack of control over these concerns, fully developed games may lack the intended educational value. We aim to improve educational game development by structuring and partly automating this process. We propose Didactics-Driven Development, a novel framework for keeping didactic goals and concerns in focus throughout the development process. By making didactic concerns explicit, it enables testing interaction patterns against opportunities for learning. We discuss how the approach has been applied to three case studies and how this has informed ongoing development of the framework.",
      "keywords": "didactics-driven development, educational game development, game design framework, game tutorials, learning opportunities, playtraces",
      "citation": "@inproceedings{bouwer2025didactics,  title={Towards Didactics-Driven Development of Educational Games}, author={Anders Bouwer and Riemer van Rozen}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2025}}"
    },
    {
      "title": "A Framework to Even-Out Racetrack Bias",
      "year": 2024,
      "authors": "Mirkamil Majid, Roger Crawfis",
      "abstract": "Procedural Content Generation (PCG) has demonstrated its capability to create compelling game content across various domains, including racing games. In this paper, a novel approach utilizing PCG is presented that aims to generate racetracks with the primary objective of ensuring fairness and balanced gameplay regardless of the player?s vehicle choice. The proposed framework comprises three distinct phases: During the first phase, modular racetrack segments are procedurally generated in order to enhance track variety, which plays a crucial role in providing an engaging gaming experience. In the second phase, AI car controllers are employed on different vehicles to simulate driving through all generated racetrack segments, gathering various statistics. This step allows for the collection of data that will inform decision-making during the final assembly of the complete racetrack. Finally, in the third phase, the collected data is utilized to select and assemble the most suitable racetrack segments, ensuring fairness for all simulated vehicle types by avoiding any potential unfair advantages or disadvantages. To further support this innovative framework, its theoretical foundation is explored, and detailed explanations of each step involved in the process are provided.",
      "keywords": "racetrack generation, procedural content generation, gameplay balance, racing, tiling, bias",
      "citation": "@inproceedings{majid2024evenout,  title={A Framework to Even-Out Racetrack Bias}, author={Mirkamil Majid and Roger Crawfis}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "AutoVyaz: Automating the Formation of Slavic Calligraphy Ligatures",
      "year": 2024,
      "authors": "Alexey Tikhonov",
      "abstract": "This paper introduces a procedural technique for the automated generation of Slavic Vyaz, a traditional Cyrillic calligraphy style known for its ornamental complexity and cultural significance. By developing a specialized description of font geometry that includes anchor points and edges to define character shapes, our approach facilitates the creation of ligatures and character deformations that maintain the aesthetic and rhythmic qualities of Vyaz. We propose several heuristics for arranging text layouts that enable the generation of calligraphic patterns, which can be customized and adapted to various design needs. Our technique?s capability to simulate traditional calligraphy is demonstrated through comparative analyses and examples of preliminary results.",
      "keywords": "slavic calligraphy, vyaz, automated calligraphy generation, digital typography, cultural heritage preservation, procedural content generation",
      "citation": "@inproceedings{tikhonov2024autovyaz,  title={AutoVyaz: Automating the Formation of Slavic Calligraphy Ligatures}, author={Alexey Tikhonov}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Experiments in Motivating Exploratory Agents",
      "year": 2024,
      "authors": "Bobby Khaleque, Michael Cook, Jeremy Gow",
      "abstract": "Exploration is found in a variety of game genres, but there has been little research in the context of PCG. This paper investigates the potential for exploratory agents to provide feedback on how well levels support exploration, with the ultimate goal of guiding level generation. We propose several motivations which might drive exploratory behaviour and model these as metrics within an agent framework based on context steering. We present a study of how the different metrics influence exploration of six game levels. It was found that combinations of metrics lead to distinct exploratory behaviours, mostly within our expectations.",
      "keywords": "game ai, agents, exploration, exploratory agents, procedural content generation, level design, automated level evaluation",
      "citation": "@inproceedings{khaleque2024motivating,  title={Experiments in Motivating Exploratory Agents}, author={Bobby Khaleque and Michael Cook and Jeremy Gow}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Hunt Takes Hare: Theming Games Through Game-Word Vector Translation",
      "year": 2024,
      "authors": "Youn?s Rabii, Michael Cook",
      "abstract": "A game?s theme is an important part of its design ? it conveys narrative information, rhetorical messages, helps the player intuit strategies, aids in tutorialisation and more. Thematic elements of games are notoriously difficult for AI systems to understand and manipulate, however, and often rely on large amounts of hand-written interpretations and knowledge. In this paper we present a technique which connects game embeddings, a recent method for modelling game dynamics from log data, and word embeddings, which models semantic information about language. We explain two different approaches for using game embeddings in this way, and show evidence that game embeddings enhance the linguistic translations of game concepts from one theme to another, opening up exciting new possibilities for reasoning about the thematic elements of games in the future.",
      "keywords": "procedural content generation, automated game design, computational creativity",
      "citation": "@inproceedings{rabii2024theming,  title={Hunt Takes Hare: Theming Games Through Game-Word Vector Translation}, author={Youn?s Rabii and Michael Cook}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Literally Unplayable: On Constraint-Based Generation of Uncompletable Levels",
      "year": 2024,
      "authors": "Seth Cooper, Mahsa Bazzaz",
      "abstract": "Most research in procedural content generation has, understandably, focused on generating levels that are completable?that is, levels where it is possible for a player to complete them. In this work we explore the generation of uncompletable levels and their applications. Building on an existing constraint-based level generator, we add support for constraints that a level?s goal is not reachable from its start. The generator can thus create levels that are similar to completeable levels in many ways (such as local tile patterns), yet are not possible to complete. We then describe several applications of those constraints and the resulting levels, including: qualitatively characterizing what makes levels uncompletable; creating training data for completability classifiers; checking that a generator can only generate completable levels; and generating levels that require the player to use a special move.",
      "keywords": "procedural content generation, constraints, completability",
      "citation": "@inproceedings{cooper2024constraint,  title={Literally Unplayable: On Constraint-Based Generation of Uncompletable Levels}, author={Seth Cooper and Mahsa Bazzaz}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Mixed-initiative generation of virtual worlds - a comparative study on the cognitive load of WFC and HSWFC",
      "year": 2024,
      "authors": "Shaad Alaka, Rafael Bidarra",
      "abstract": "Procedural Content Generation (PCG) has long been proposed as an answer to the increased workload imposed on designers of virtual worlds, although often at the cost of controllability and expression of designer intent. Mixed-initiative approaches promise to overcome this, and valid proposals have been made of mixed-initiative editors, e.g. driven by the Wave Function Collapse (WFC) algorithm. However, stock WFC operates on a simple tileset without any hierarchy or semantic clustering, preventing designers from fluently expressing level of detail, leaving the constraint solving burden partly on them instead of on the algorithm. Hierarchical Semantic Wave Function Collapse (HSWFC) claims to solve this problem by hierarchically structuring its tileset of semantic tiles, featuring meta-tiles that can undergo intermediate collapses. Employing an HSWFC interactive editor offering such features may significantly reduce cognitive load and, thus, make such an editor more appealing for widespread use. We describe a user study to test this hypothesis, by comparing and discussing the cognitive load assessed on designers using either a stock WFC-driven editor or an HSWFC-driven editor. Our findings confirm that there is a significant reduction in cognitive load when the HSWFC editor is employed in comparison to the stock WFC editor.",
      "keywords": "procedural content generation, wave function collapse, world editing, mixed-initiative, cognitive load",
      "citation": "@inproceedings{alaka2024mixedinitiative,  title={Mixed-initiative generation of virtual worlds - a comparative study on the cognitive load of WFC and HSWFC}, author={Shaad Alaka and Rafael Bidarra}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Prompt Wrangling: On Replication and Generalization in Large Language Models for PCG Levels",
      "year": 2024,
      "authors": "Arash Moradi Karkaj, Mark J. Nelson, Ioannis Koutis, Amy K. Hoover",
      "abstract": "The ChatGPT4PCG competition calls for participants to submit inputs to ChatGPT or prompts that guide its output toward instructions to generate levels as sequences of Tetris-like block drops. Prompts submitted to the competition are queried by ChatGPT to generate levels that resemble letters of the English alphabet. Levels are evaluated based on their similarity to the target letter and physical stability in the game engine. This provides a quantitative evaluation setting for prompt-based procedural content generation (PCG), an approach that has been gaining popularity in PCG, as in other areas of generative AI. This paper focuses on replicating and generalizing the competition results. The replication experiments in the paper first aim to test whether the number of responses gathered from ChatGPT is sufficient to account for the stochasticity requery the original prompt submissions to rerun the original scripts from the competition on different machines about six months after the competition organizers. We re-run the competition, using the original scripts, but on our own machines, several months later, and with varying sample sizes. We find that results largely replicate, except that two of the 15 submissions do much better in our replication, for reasons we can only partly determine. When it comes to generalization, we notice that the top-performing prompt has instructions for all 26 target levels hardcoded, which is at odds with the PCGML goal of generating new, previously unseen content from examples. We perform experiments in a more restricted few-shot prompting scenario, and find that generalization remains a challenge for current approaches.",
      "keywords": "procedural content generation (pcg), large language models (llms), generalizability, evaluating generalization, science birds",
      "citation": "@inproceedings{moradi2024prompt,  title={Prompt Wrangling: On Replication and Generalization in Large Language Models for PCG Levels}, author={Arash Moradi Karkaj and Mark J. Nelson and Ioannis Koutis and Amy K. Hoover}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Solution Path Heuristics for Predicting Difficulty and Enjoyment Ratings of Roguelike Level Segments",
      "year": 2024,
      "authors": "Colan Biemer, Seth Cooper",
      "abstract": "When generating levels, algorithmically evaluating the results is essential. In this paper, we looked at predicting a level?s difficulty and enjoyment. Past work has approached this problem for puzzle games like Sudoku by analyzing the characteristics of the initial level, the solved level, and the process that led to that solution. In this work, we examined a set of heuristics for Roguelike levels and their solutions, and their relationship to subjective player ratings of the levels. We gathered ratings of difficulty and enjoyment of levels in a study with 143 players. We ran an ablation study on the set of heuristics to find the best combination of heuristics for predicting difficulty and enjoyment with a linear regression model, and found solution path-based heursitics performed well. However, these models did not outperform a simple baseline for predicting enjoyment. Jaccard similarity on paths?a method we have not seen used in the field of game AI?was a useful predictor of difficulty. Testing proximity to enemies across a solution path is the only heuristic needed to predict how enjoyable a level will be.",
      "keywords": "procedural content generation, difficulty, player study",
      "citation": "@inproceedings{biemer2024solution,  title={Solution Path Heuristics for Predicting Difficulty and Enjoyment Ratings of Roguelike Level Segments}, author={Colan Biemer and Seth Cooper}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "The Puzzle Forecast: Tutorial Analytics Predict Trial and Error",
      "year": 2024,
      "authors": "Dennis Vet, Riemer van Rozen",
      "abstract": "Puzzle tutorials are designed to teach puzzle-solving skills. For game designers, the difficulty is predicting if puzzle challenges will present players with opportunities for learning with trial and error. We aim to empower designers with tools and techniques for making those predictions by analyzing the goal chains inherent to good designs. We study PuzzleScript, an online game engine that has made the source code of high-quality puzzle tutorials available. Research on puzzles has yielded algorithms that can generate playtraces of solutions. However, until now the importance of failure traces has been mostly overlooked. As a result, there is a lack of tools with analytics that can help assess challenge. To deliver them, we propose a novel approach that enriches playtraces with verbs. We introduce TutoScript, a language for expressing goal chains in terms of verbs. By combining TutoScript with well-known search algorithms, and by mapping rules to verbs, TutoMate can enrich, analyze and visualize generated playtraces of solutions, failures and dead ends. Two case studies on Lime Rick and Block Faker demonstrate how it helps to analyze simple goal chains, and can also detect broken tutorials. Our solution takes a promising step towards generic techniques for analyzing and generating tutorials.",
      "keywords": "automated game design, domain-specific languages, puzzle tutorials, verbs, skill atoms, analytics, learning, trial and error",
      "citation": "@inproceedings{vet2024tutorial,  title={The Puzzle Forecast: Tutorial Analytics Predict Trial and Error}, author={Dennis Vet and Riemer van Rozen}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Towards Generating Surprising Content in 2D Platform Games",
      "year": 2024,
      "authors": "Chandranil Chakraborttii, Lucas Ferreirra",
      "abstract": "Surprise is a key factor for driving engagement in video games. By incorporating unexpected elements, games can create a sense of excitement and curiosity, leading to a more immersive and enjoyable experience. In this paper, we propose a framework for generating levels in 2D platform games with embedded surprising content. Building upon the VCL (Violation of Expectation, Caught Off Guard, and Learning) model, we use it as a conceptual foundation to curate surprise by altering specific game elements (called metrics) during the level generation process. We developed a tile-based parametric level generator for Super Mario Bros., creating customized levels based on metrics such as linearity, enemy density, and pattern variation, among others. 393 participants in our study played 2 generated levels, with the first setting expectations and the second intentionally violating them by altering chosen metrics. By comparing player responses and gameplay data with the VCL model, we explore the phenomenon of surprise in games. Our findings reveal statistically significant correlations between certain metrics and player responses, teasing at the potential for automatically generating surprising levels in 2D platform games.",
      "keywords": "",
      "citation": "@inproceedings{chakraborttii2024towards,  title={Towards Generating Surprising Content in 2D Platform Games}, author={Chandranil Chakraborttii and Lucas Ferreirra}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "Translating Between Game Generators with Asterism and Ceptre",
      "year": 2024,
      "authors": "Cynthia Li, Joseph Osborn",
      "abstract": "In this paper, we present in-progress work that converts games made with Ceptre, a genre-agnostic game description language, into graphical games using the framework of operational logics. Our preliminary code targets the translation of tilemap-based dungeon crawlers, but we present strategies for generalizing this process to other Ceptre games and Asterism engines. We gesture at the potential of operational logics and Asterism as a tool to communicate across the many frameworks surrounding game development and playing.",
      "keywords": "game generators, operational logics, formal models",
      "citation": "@inproceedings{li2024translating,  title={Translating Between Game Generators with Asterism and Ceptre}, author={Cynthia Li and Joseph Osborn}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2024}}"
    },
    {
      "title": "\"Generator's Haunted\": A Brief, Spooky Account of Hauntological Effects in the Player Experience of Procedural Generation",
      "year": 2023,
      "authors": "Max Kreminski",
      "abstract": "Theories of the poetics of procedural generation attempt to explain the player experience of interacting with generators by describing the aesthetic or experiential qualities that generators can afford when they are deployed in particular ways. We propose that an underinvestigated aspect of procgen poetics?the experiential effects of the sequencing of generated artifacts?can be understood in terms of hauntology, a theory of textual interpretation that aims to account for the lingering effects of past texts (and their implied futures) on present ones. We briefly introduce hauntology, discuss a few examples of hauntological effects in player experiences of procgen, and gesture at implications for future technical work.",
      "keywords": "procedural generation, player experience, poetics, hauntology",
      "citation": "@inproceedings{kreminski2023generator,  title={\"Generator's Haunted\": A Brief, Spooky Account of Hauntological Effects in the Player Experience of Procedural Generation}, author={Max Kreminski}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "Conceptual Art Made Real: Why Procedural Content Generation is Impossible",
      "year": 2023,
      "authors": "Isaac Karth and Kate Compton",
      "abstract": "Procedural content generation is impossible: insofar as it is popularly understood as the generation of artifacts that can give us the same experience as if a human had crafted them by hand, it involves an intrinsic contradiction. If a thing has been generated once, it can be generated again. Kate Compton has introduced a term for this unending content: liquid art. Compton?s category of the ?Bach faucet? describes the way that the endless supply of generativity destroys rarity. Conceptual art provides some examples of navigating this paradox. The PCG community is uniquely positioned to provide direction because of its existing understanding of the properties of generativity as an art form.",
      "keywords": "procedural content generation, liquid art, bach faucet, conceptual art",
      "citation": "@inproceedings{karth2023conceptual,  title={Conceptual Art Made Real: Why Procedural Content Generation is Impossible}, author={Isaac Karth and Kate Compton}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "Hierarchical Semantic Wave Function Collapse",
      "year": 2023,
      "authors": "Shaad Alaka and Rafael Bidarra",
      "abstract": "There are few proposals to improve the interactivity and control of wave function collapse (WFC) in a mixed-initiative setting. Moreover, most WFC algorithm variants operate on an simple, unstructured set of tiles. This limitation on the level of control provided to designers hampers their creative work in various ways. We propose Hierarchical Semantic WFC, a generalized approach to WFC that organizes its tile-set into a hierarchy akin to a taxonomy induced by the relation ?consists-of?. In such a hierarchical structure, abstract tiles (i.e. non-leaf nodes) can represent the first sketchy intentions of a designer (e.g. forest, urban, desert,...) This allows a designer to interactively collapse a given area into abstract tiles, while subsequently, (and repeatedly, if desired) WFC can resolve each area into a variety of particular instances, by further collapsing it into (a valid combination of) its children tiles (whether leaves or not). We identify how this subtle tile-set change affects the whole WFC algorithm, describe a number of novel exploratory and interactive functions that this enables, and showcase these with a variety of examples generated with our prototype implementation. We conclude that these new mixed-initiative content generation methods can considerably reduce design iteration times and improve the assistance given to designers in expressing their creative intent.",
      "keywords": "procedural content generation, wave function collapse, mixed-initiative, object semantics",
      "citation": "@inproceedings{alaka2023hierarchical,  title={Hierarchical Semantic Wave Function Collapse}, author={Shaad Alaka and Rafael Bidarra}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "Interactive Latent Variable Evolution for the Generation of Minecraft Structures",
      "year": 2023,
      "authors": "Tim Merino, M Charity and Julian Togelius",
      "abstract": "The open-world sandbox game Minecraft is well-known for applying a wide array of procedural content generation techniques to create unique and expansive game environments. However, procedurally generated buildings are absent in the Minecraft world, thus players must build their own structures to flesh out their worlds. This build process can be extremely time-consuming and appeals to more creatively-inclined players. To aid players in this process, we introduce a tool combining interactive evolution with latent variable evolution to evolve procedurally generated Minecraft structures to a player?s aesthetic choices. We employ two separate neural network models to generate structures: a 3D generative model for generating the structure design and an encoding model for applying Minecraft textures to the structure?s voxels. We evaluate this tool with a user study incorporating an online interface that allows participants to select, evolve, and guide a population of these generated 3D structures towards a specific design goal.",
      "keywords": "",
      "citation": "@inproceedings{merino2023interactive,  title={Interactive Latent Variable Evolution for the Generation of Minecraft Structures}, author={Tim Merino and M Charity and Julian Togelius}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "Level Generation Through Large Language Models",
      "year": 2023,
      "authors": "Graham Todd, Sam Earle, Muhammad Nasir, Michael Green and Julian Togelius",
      "abstract": "Large Language Models (LLMs) are powerful tools, capable of leveraging their training on natural language to write stories, generate code, and answer questions. But can they generate functional video game levels? Game levels, with their complex functional constraints and spatial relationships in more than one dimension, are very different from the kinds of data an LLM typically sees during training. Datasets of game levels are also hard to come by, potentially taxing the abilities of these data-hungry models. We investigate the use of LLMs to generate levels for the game Sokoban, finding that LLMs are indeed capable of doing so, and that their performance scales dramatically with dataset size. We also perform preliminary experiments on controlling LLM level generators and discuss promising areas for future work.",
      "keywords": "procedural content generation, sokoban, language models, transformers",
      "citation": "@inproceedings{todd2023level,  title={Level Generation Through Large Language Models}, author={Graham Todd and Sam Earle and Muhammad Nasir and Michael Green and Julian Togelius}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "Lode Enhancer: Level Co-creation Through Scaling",
      "year": 2023,
      "authors": "Debosmita Bhaumik, Julian Togelius, Georgios N. Yannakakis and Ahmed Khalifa",
      "abstract": "We explore AI-powered upscaling as a design assistance tool in the context of creating 2D game levels. Deep neural networks are used to upscale artificially downscaled patches of levels from the puzzle platformer game Lode Runner. The trained networks are incorporated into a web-based editor, where the user can create and edit levels at three different levels of resolution: 4x4, 8x8, and 16x16. An edit at any resolution instantly transfers to the other resolutions. As upscaling requires inventing features that might not be present at lower resolutions, we train neural networks to reproduce these features. We introduce a neural network architecture that is capable of not only learning upscaling but also giving higher priority to less frequent tiles. To investigate the potential of this tool and guide further development, we conduct a qualitative study with 3 designers to understand how they use it. Designers enjoyed co-designing with the tool, liked its underlying concept, and provided feedback for further improvement.",
      "keywords": "neural networks, mixed-initiative, supervised learning, procedural content generation, upscaling",
      "citation": "@inproceedings{bhaumik2023lode,  title={Lode Enhancer: Level Co-creation Through Scaling}, author={Debosmita Bhaumik and Julian Togelius and Georgios N. Yannakakis and Ahmed Khalifa}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "Re-trainable Procedural Level Generation via Machine Learning (RT-PLGML) as Game Mechanic",
      "year": 2023,
      "authors": "Seth Cooper, Emily Halina, Jichen Zhu and Matthew Guzdial",
      "abstract": "We present re-trainable procedural level generation via machine learning (RT-PLGML), a game mechanic of providing in-game training examples for a PLGML system. We discuss opportunities and challenges, along with concept RT-PLGML games.",
      "keywords": "procedural content generation, machine learning, video games",
      "citation": "@inproceedings{cooper2023retrainable,  title={Re-trainable Procedural Level Generation via Machine Learning (RT-PLGML) as Game Mechanic}, author={Seth Cooper and Emily Halina and Jichen Zhu and Matthew Guzdial}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "Sturgeon-MKIII: Simultaneous Level and Example Playthrough Generation via Constraint Satisfaction with Tile Rewrite Rules",
      "year": 2023,
      "authors": "Seth Cooper",
      "abstract": "Completability is a key aspect of procedural level generation. In this work, we present a constraint-based approach to level generation for 2D tile-based games that simultaneously generates a level and an example playthrough of the level demonstrating its completability. The approach represents game mechanics as tile rewrite rules, which allows a variety of games and mechanics (beyond simple pathfinding) to be incorporated. The mechanics are represented as constraints in the same problem along with the constraints used to generate the level itself. Thus, the solution to the constraint problem contains both a level and a playthrough of the level. We demonstrate the flexibilty of the system and of tile rewrite rules in several applications, including lock-and-key dungeons, platformers, puzzles, and match-three style games.",
      "keywords": "procedural content generation, constraints, tile rewrite rules",
      "citation": "@inproceedings{cooper2023sturgeon,  title={Sturgeon-MKIII: Simultaneous Level and Example Playthrough Generation via Constraint Satisfaction with Tile Rewrite Rules}, author={Seth Cooper}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "That Darned Sandstorm: A Study of Procedural Generation through Archaeological Storytelling",
      "year": 2023,
      "authors": "Florence Smith Nicholls and Michael Cook",
      "abstract": "Procedural content generation has been applied to many domains, especially level design, but the narrative affordances of generated game environments are comparatively understudied. In this paper we present our first attempt to study these effects through the lens of what we call a generative archaeology game that prompts the player to archaeologically interpret the generated content of the game world. We report on a survey that gathered qualitative and quantitative data on the experiences of 187 participants playing the game Nothing Beside Remains. We provide some preliminary analysis of our intentional attempt to prompt player interpretation, and the unintentional effects of a glitch on the player experience of the game.",
      "keywords": "procedural generation, emergent narrative, archaeogaming",
      "citation": "@inproceedings{nicholls2023darned,  title={That Darned Sandstorm: A Study of Procedural Generation through Archaeological Storytelling}, author={Florence Smith Nicholls and Michael Cook}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2023}}"
    },
    {
      "title": "A General-Purpose Expressive Algorithm for Room-based Environments",
      "year": 2022,
      "authors": "Konstantinos Sfikas, Antonios Liapis, Georgios N. Yannakakis",
      "abstract": "This paper presents a generative architecture for general-purpose room layouts that can be treated as geometric definitions of dungeons, mansions, shooter levels and more. The motivation behind this work is to provide a design tool for virtual environments that combines aspects of controllability, expressivity and generality. Towards that end, a two-tier level representation is realized, with a graph-based design specification constraining and guiding the generated geometries, facilitated by constrained evolutionary search. Expressivity is secured through quality-diversity search which can provide the designer with a broad variety of level layouts to choose from. Finally, the generator is general-purpose as it can produce layouts based on different types of static grid structures or as free-form, curved structures through an adaptive Voronoi diagram that is evolved along with the level itself. The method is tested on a variety of design specifications and grid types, and results show that even with complex design constraints or malleable grids the algorithm can produce a broad variety of levels.",
      "keywords": "level generation, controllability, evolutionary algoritms, quality diversity search, constrained optimization",
      "citation": "@inproceedings{sfikas2022ageneral,  title={A General-Purpose Expressive Algorithm for Room-based Environments}, author={Konstantinos Sfikas and Antonios Liapis and Georgios N. Yannakakis}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "A Procedural Model for Diverse Tree Species",
      "year": 2022,
      "authors": "Rama Hoetzlein",
      "abstract": "The modeling of trees represents a unique and classical challenge in computer graphics. Models of 3D trees must express the form, complexity, structure, growth and diversity of real trees. Presently the most common methods for the modeling of 3D trees include a) user-based creative modeling, b) direct geometric capture such as LIDAR and photogrammetry, or c) indirect methods such as machine learning from images. These techniques often require significant human effort, large amounts of data, considerable computation resources, or any of the above. While there are methods that consider the direct procedural generation of trees, current models often require some human supervision to focus on naturally plausible variants. Instead, our approach is to construct a botanically-inspired, harmonic, procedural model for trees which directly produces realistic yet diverse trees.",
      "keywords": "procedural modeling, trees, vegetation, particle systems",
      "citation": "@inproceedings{hoetzlein2022aprocedural,  title={A Procedural Model for Diverse Tree Species}, author={Rama Hoetzlein}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "Debugging Procedural Level Designs with Mental Maps",
      "year": 2022,
      "authors": "Riemer van Rozen, Georgia Samaritaki, Joris Dormans",
      "abstract": "Procedural Level Generation provides tools and techniques for generating many game levels from a single specification. Instead of creating levels by hand, level designers make use of generators that automate the creation process. However, iteratively improving a level?s design requires encoding generators of adventures, puzzles and encounters in notations that bear little resemblance to generated content. Raising the level quality is difficult, because it is hard to reason about bugs that can manifest inside generated content. We take the position that debugging requires special attention. We argue that advancing the area calls for tools and debugging techniques that speed up procedural level design and empower level designers. We propose exploring how Domain-Specific Languages can help in authoring a level?s design, validating the generator?s code, and debugging issues in generated content. We introduce Mental Maps, a visual language that expresses the spacial relations between rooms, objects and paths. We discuss how Mental Maps can serve as generator blueprints before the generation happens, and as debugging lenses for projecting issues afterwards.",
      "keywords": "procedural content generation, level design, debugging",
      "citation": "@inproceedings{vanrozen2022debugging,  title={Debugging Procedural Level Designs with Mental Maps}, author={Riemer van Rozen and Georgia Samaritaki and Joris Dormans}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "Entropy Lost: Nintendo?s Not-So-Random Sequence of 32,767 Bits",
      "year": 2022,
      "authors": "Trang Ngo, Aaron Williams",
      "abstract": "Early video game consoles did not have hardware support for random number generation, so developers needed to employ software methods for RNG. We show that hundreds of games in the Nintendo Famicom / NES library repeatedly generate the same sequence of 32,767 pseudorandom bits, and the machine code to generate these bits comes in more than fifty different variants. We identified the disparate implementations by developing a simple regular expression that matches the following \"fingerprint\" of opcodes: LDA, AND, STA, LDA, AND, EOR, CLC, BEQ, SEC, ROR. These instructions implement a 15-bit linear feedback shift register associated with the primitive polynomial x^15 + x^7 + 1 (i.e., tap the 15th and 7th bits). However, many of the games had a loftier goal, and devoted more memory to the LFSR's state. For example, the launch title Donkey Kong (1983) used 8 bytes (or 8 x 8 = 64 bits), The Legend of Zelda (1986) used 13 bytes, and Super Mario Bros. 3 (1988) used 9 bytes. In each case, the randomization is spoiled by a simple programming error: the bits are shifted in the wrong direction. We use these findings to study how randomization is used in many classic games. We also uncover one developer who fixed the mistake.",
      "keywords": "nintendo, famicom, nes, rng, linear feedback shift register, bug",
      "citation": "@inproceedings{ngo2022entropylost,  title={Entropy Lost: Nintendo?s Not-So-Random Sequence of 32,767 Bits}, author={Trang Ngo and Aaron Williams}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "Learning Controllable 3D Level Generators",
      "year": 2022,
      "authors": "Zehua Jiang, Sam Earle, Michael Green, Julian Togelius",
      "abstract": "Procedural Content Generation via Reinforcement Learning (PCGRL) foregoes the need for large human-authored data-sets and allows agents to train explicitly on functional constraints, using computable, user-defined measures of quality instead of target output. We explore the application of PCGRL to 3D domains, in which content-generation tasks naturally have greater complexity and potential pertinence to real-world applications. Here, we introduce several PCGRL tasks for the 3D domain, Minecraft (Mojang Studios, 2009). These tasks will challenge RL-based generators using affordances often found in 3D environments, such as jumping, multiple dimensional movement, and gravity. We train an agent to optimize each of these tasks to explore the capabilities of previous research in PCGRL. This agent is able to generate relatively complex and diverse levels, and generalize to random initial states and control targets. Controllability tests in the presented tasks demonstrate their utility to analyze success and failure for 3D generators.",
      "keywords": "reinforcement learning, level generation, pcg, procedural content generation, learning generators, minecraft, maze generation",
      "citation": "@inproceedings{jiang2022learning,  title={Learning Controllable 3D Level Generators}, author={Zehua Jiang and Sam Earle and Michael Green and Julian Togelius}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "Mutation Models: Learning to Generate Levels by Imitating Evolution",
      "year": 2022,
      "authors": "Ahmed Khalifa, Michael Green, Julian Togelius",
      "abstract": "Search-based procedural content generation (PCG) is a well-known method for level generation in games. Its key advantage is that it is generic and able to satisfy functional constraints. However, due to the heavy computational costs to run these algorithms online, search-based PCG is rarely utilized for real-time generation. In this paper, we introduce mutation models, a new type of iterative level generator based on machine learning. We train a model to imitate the evolutionary process and use the trained model to generate levels. This trained model is able to modify noisy levels sequentially to create better levels without the need for a fitness function during inference. We evaluate our trained models on a 2D maze generation task. We compare several different versions of the method: training the models either at the end of evolution (normal evolution) or every 100 generations (assisted evolution) and using the model as a mutation function during evolution. Using the assisted evolution process, the final trained models are able to generate mazes with a success rate of 99% and high diversity of 86%. The trained model is many times faster than the evolutionary process it was trained on. This work opens the door to a new way of learning level generators guided by an evolutionary process, meaning automatic creation of generators with specifiable constraints and objectives that are fast enough for runtime deployment in games.",
      "keywords": "neural networks, evolutions, data augmentation, surrogate models, procedural content generation, expressive range analysis, level generation",
      "citation": "@inproceedings{khalifa2022mutationmodels,  title={Mutation Models: Learning to Generate Levels by Imitating Evolution}, author={Ahmed Khalifa and Michael Green and Julian Togelius}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "Procedural Game Level Design to Trigger Spatial Exploration",
      "year": 2022,
      "authors": "Pedro Acevedo, Minsoo Choi, Huimin Liu, Dominic Kao, Christos Mousas",
      "abstract": "In this paper, we propose a method to synthesize open world game level that trigger spatial exploration. We benefited from recent work that had proposed game level design patterns to evoke curiosity, and we propose an approach to automatically synthesizing game levels in order to encourage players to pursue designer-specified exploration goals. We started by creating a dataset of level assets, based on the four design patterns that evoke curiosity-driven exploration in games (reaching extreme points, resolving visual obstructions, out-of-place objects, and understanding spatial connections). We annotated the assets in our dataset with spatial exploration measurements. We then formulated game level design as an optimization problem and we solved this problem by implementing a reversible-jump Markov chain Monte Carlo method. We demonstrate our method's ability to synthesize game level variations with different spatial exploration and level design decisions. Finally, a user study showed that our approach can automatically synthesize game levels, encouraging a certain amount of spatial exploration by players.",
      "keywords": "spatial exploration, curiosity, game level, level design, procedural content generation",
      "citation": "@inproceedings{acevedo2022exploration,  title={Procedural Game Level Design to Trigger Spatial Exploration}, author={Pedro Acevedo and Minsoo Choi and Huimin Liu and Dominic Kao and Christos Mousas}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "Representing Exploration in Metroidvania Games: A demo of the 'exploration' Python library",
      "year": 2022,
      "authors": "Peter A. Mawhorter, Indira Ruslanova, Ross Mawhorter",
      "abstract": "Exploration is a core gameplay element in many games, but it has a special central place in the Metroidvania genre, where hidden powerups, backtracking, and map-based navigation are genre-defining elements. At the same time, space in Metroidvania games can be quite well represented by an abstract topology (i.e., a graph of connections between rooms), without needing to deal with the details of a grid-based or survey-type models of spatial relationships. These two properties give rise to unique challenges and opportunities in understanding the player experience of exploration in these games. This demo will walk the audience through `exploration`, an open-source Python library available on PyPI which includes data structures for representing exploration processes in discrete decision spaces including Metroidvania games, as well as parsing routines for a journal format to easily express exploration data by hand.",
      "keywords": "exploration, graphs, player experience, metroidvania",
      "citation": "@inproceedings{mawhorter2022representing,  title={Representing Exploration in Metroidvania Games: A demo of the 'exploration' Python library}, author={Peter A. Mawhorter and Indira Ruslanova and Ross Mawhorter}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "The Fun Facets of Mario: Multifaceted Experience-Driven PCG via Reinforcement Learning",
      "year": 2022,
      "authors": "Ziqi Wang, Julian Liu, Georgios N. Yannakakis",
      "abstract": "The recently introduced EDRL framework approaches the experience-driven (ED) procedural generation of game content via a reinforcement learning (RL) perspective. EDRL has so far shown its effectiveness in generating novel platformer game levels endlessly in an online fashion. This paper extends the EDRL framework significantly by enabling faster and more efficient game content generation through an episodic generative soft actor-critic algorithm. We further enhance the generality of EDRL by integrating multiple facets of game creativity in the ED generation process and test it on the creative facets of game level and gameplay design in Super Mario Bros. Inspired by Koster's theory of fun, we formulate fun as moderate degree of level or gameplay divergence and equip EDRL with such reward functions. The resulting algorithm is not only capable of generating fun levels efficiently, it is also robust with respect to dissimilar playing styles and initial game level conditions.",
      "keywords": "experience-driven procedural content generation, procedural content generation via reinforcement learning, diversity, online level generation, platformer games, super mario bros",
      "citation": "@inproceedings{wang2022thefun,  title={The Fun Facets of Mario: Multifaceted Experience-Driven PCG via Reinforcement Learning}, author={Ziqi Wang and Julian Liu and Georgios N. Yannakakis}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "The Randomizer Community does Procedural Content Generation Research",
      "year": 2022,
      "authors": "Ross Mawhorter, Peter A. Mawhorter, Adam Smith",
      "abstract": "Academic Procedural Content Generation research has until recently overlooked a significant real-world application of generative methods to existing games: game randomizers. These programs remix existing games by changing things like item locations, enemy stats, or even room connections to create a fresh experience based on a beloved game, and are especially popular among speedrunning and streaming communities. They generate where high-production-quality full-scale games, explicitly geared towards replay value. Randomizers fulfill many of the stated motivations of the academic PCG research community, and important new research directions can be developed by investigating this space.",
      "keywords": "procedural content generation, randomizers, playability",
      "citation": "@inproceedings{mawhorter2022therandomizer,  title={The Randomizer Community does Procedural Content Generation Research}, author={Ross Mawhorter and Peter A. Mawhorter and Adam Smith}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "TropeTwist: Trope-based Narrative Structure Generation",
      "year": 2022,
      "authors": "Aberto Alvarez, Jose Font",
      "abstract": "Games are complex, multi-faceted systems that share common elements and underlying narratives, such as the conflict between a hero and a big bad enemy or pursuing a goal that requires overcoming challenges. However, identifying and describing these elements together is non-trivial as they might differ in certain properties and how players might encounter the narratives. Likewise, generating narratives also pose difficulties when encoding, interpreting, and evaluating them. To address this, we present TropeTwist, a trope-based system that can describe narrative structures in games in a more abstract and generic level, allowing the definition of games' narrative structures and their generation using interconnected tropes, called narrative graphs. To demonstrate the system, we represent the narrative structure of three different games. We use MAP-Elites to generate and evaluate novel quality-diverse narrative graphs encoded as graph grammars, using these three hand-made narrative structures as targets. Both hand-made and generated narrative graphs are evaluated based on their coherence and interestingness, which are improved through evolution.",
      "keywords": "authoring tools, narrative generation, evolutionary computation, map-elites, computer games",
      "citation": "@inproceedings{alvarez2022tropetwist,  title={TropeTwist: Trope-based Narrative Structure Generation}, author={Aberto Alvarez and Jose Font}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "miWFC - Designer empowerment through mixed-initiative Wave Function Collapse",
      "year": 2022,
      "authors": "Thimen S. L. Langendam, Rafael Bidarra",
      "abstract": "Wave Function Collapse (WFC) is a powerful generative algorithm, able to create locally-similar output based on a single example input. One of the inherent limitations of the original WFC is that it often requires users to understand its inner workings, and possibly make their own ad-hoc mods, to achieve satisfactory results. Besides distracting from your creative task, this strongly reduces the algorithm's effective usefulness to a small group of technical users. We propose miWFC, a novel mixed-initiative approach to WFC aimed at overcoming these drawbacks. Its main focus is on providing intuitive control to its users, in a way that matches their usual creative workflow. Among its main features, this approach provides (i) interactive navigation through design history, including controlled backtracking, (ii) precise manual editing on the output for direct expression of design intent, and (iii) interactive manipulation of tile weights, to tweak the global appearance of the output. We evaluated a prototype implementation of our approach among game artists and other creative professionals, and concluded that its features were largely considered useful and supportive of their creative work.",
      "keywords": "procedural content generation, mixed-initiative, human-computer interaction, interaction design, wave function collapse, level generation, texture synthesis, constraint solving",
      "citation": "@inproceedings{langendam2022miwfc,  title={miWFC - Designer empowerment through mixed-initiative Wave Function Collapse}, author={Thimen S. L. Langendam and Rafael Bidarra}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2022}}"
    },
    {
      "title": "Comparing PCG Metrics with Human Evaluation in Minecraft Settlement Generation",
      "year": 2021,
      "authors": "Jean-Baptiste Herve, Christoph Salge",
      "abstract": "There are a range of metrics that can be applied to the artifacts produced by procedural content generation, and several of them come with qualitative claims. In this paper, we adapt a range of existing PCG metrics to generated Minecraft settlements, develop a few new metrics inspired by PCG literature, and compare the resulting measurements to existing human evaluations. The aim is to analyze how those metrics capture human evaluation scores in different categories, how the metrics generalize to another game domain, and how metrics deal with more complex artifacts. We provide an exploratory look at a variety of metrics and provide an information gain and several correlation analyses. We found some relationships between human scores and metrics counting specific elements, measuring the diversity of blocks and measuring the presence of crafting materials for the present complex blocks.",
      "keywords": "competition; experience survey; minecraft; procedural content generation; computational creativity; artificial intelligence",
      "citation": "@inproceedings{herve2021comparing,  title={Comparing PCG Metrics with Human Evaluation in Minecraft Settlement Generation}, author={Jean-Baptiste Herve and Christoph Salge}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2021}}"
    },
    {
      "title": "Ensemble Learning for Mega Man Level Generation",
      "year": 2021,
      "authors": "Bowei Li, Ruohan Chen, Yuqing Xue, Ricky Wang, Wenwen Li, Matthew Guzdial",
      "abstract": "Procedural content generation via machine learning (PCGML) is the process of procedurally generating game content using models trained on existing game content. PCGML methods can struggle to capture the true variance present in underlying data with a single model. In this paper, we investigated the use of ensembles of Markov chains for procedurally generating Mega Man levels. We conduct an initial investigation of our approach and evaluate it on measures of playability and stylistic similarity in comparison to a non-ensemble, existing Markov chain approach.",
      "keywords": "procedural content generation; ensemble methods; markov chains; mega man",
      "citation": "@inproceedings{li2021ensemble,  title={Ensemble Learning for Mega Man Level Generation}, author={Bowei Li and Ruohan Chen and Yuqing Xue and Ricky Wang and Wenwen Li and Matthew Guzdial}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2021}}"
    },
    {
      "title": "Generating Lode Runner Levels by Learning Player Paths with LSTMs",
      "year": 2021,
      "authors": "Kynan Sorochan, Jerry Chen, Yakun Yu, Matthew Guzdial",
      "abstract": "Machine learning has been a popular tool in many different fields, including procedural content generation. However, procedural content generation via machine learning (PCGML) approaches can struggle with controllability and coherence. In this paper, we attempt to address these problems by learning to generate human-like paths, and then generating levels based on these paths. We extract player path data from gameplay video, train an LSTM to generate new paths based on this data, and then generate game levels based on this path data. We demonstrate that our approach leads to more coherent levels for the game Lode Runner in comparison to an existing PCGML approach.",
      "keywords": "lode runner; lstms; markov chains",
      "citation": "@inproceedings{sorochan2021generating,  title={Generating Lode Runner Levels by Learning Player Paths with LSTMs}, author={Kynan Sorochan and Jerry Chen and Yakun Yu and Matthew Guzdial}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2021}}"
    },
    {
      "title": "Gram-Elites: N-Gram Based Quality-Diversity Search",
      "year": 2021,
      "authors": "Colan Biemer, Alejandro Hervella, Seth Cooper",
      "abstract": "In the context of procedural content generation via machine learning (PCGML), quality-diversity (QD) algorithms are a powerful tool to generate diverse game content. A branch of QD uses genetic operators to generate content (e.g. MAP-Elites). Problematically, levels generated with these operators have no guarantee of matching the style of a game. This can be addressed by incorporating whether a level is generable by an n-gram into the fitness function. Unfortunately, this leads to wasted computation and poor results. In this work, we introduce n-gram genetic operators, which produce only solutions that are generable by the n-gram model; we call MAP-Elites combined with these operators Gram-Elites. We test on a tile-based side-scrolling platformer, vertical platformer, and roguelike. For all three, n-gram operators outperform standard operators and random n-gram generation, finding more usable (i.e. completable and generable) solutions at a faster rate. By integrating structure into operators, instead of fitness, these genetic operators could be beneficial to QD in PCGML.",
      "keywords": "procedural content generation; video games; quality-diversity; n-grams;genetic operators",
      "citation": "@inproceedings{biemer2021gram,  title={Gram-Elites: N-Gram Based Quality-Diversity Search}, author={Colan Biemer and Alejandro Hervella and Seth Cooper}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2021}}"
    },
    {
      "title": "TaikoNation: Patterning-focused Chart Generation for Rhythm Action Games",
      "year": 2021,
      "authors": "Emily Halina, Matthew Guzdial",
      "abstract": "Generating rhythm game charts from songs via machine learning has been a problem of increasing interest in recent years. However, all existing systems struggle to replicate human-like patterning: the placement of game objects in relation to each other to form congruent patterns based on events in the song. Patterning is a key identifier of high quality rhythm game content, seen as a necessary component in human rankings. We establish a new approach for chart generation that produces charts with more congruent, humanlike patterning than seen in prior work.",
      "keywords": "rhythm games; neural networks; procedural content generation",
      "citation": "@inproceedings{halina2021taiko,  title={TaikoNation: Patterning-focused Chart Generation for Rhythm Action Games}, author={Emily Halina and Matthew Guzdial}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2021}}"
    },
    {
      "title": "Tessera: A Practical System for Extended WaveFunctionCollapse",
      "year": 2021,
      "authors": "Adam Newgas",
      "abstract": "Constraint-based procedural generation has recently had a lot of interest following the publication of the WaveFunctionCollapse (WFC) algorithm, but usability issues have restricted the number of games and projects that have resulted. We present Tessera, a library and tool for WFC specifically designed to address the practical issues that arise from constraint based generation. We discuss the user interface of the tool and useful extensions to the base algorithm of WFC.",
      "keywords": "procedural content generation; wavefunctioncollapse; constraint solving",
      "citation": "@inproceedings{newgas2021tessera,  title={Tessera: A Practical System for Extended WaveFunctionCollapse}, author={Adam Newgas}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2021}}"
    },
    {
      "title": "Toward Co-Creative Dungeon Generation via Transfer Learning",
      "year": 2021,
      "authors": "Zisen Zhou, Matthew Guzdial",
      "abstract": "Co-creative Procedural Content Generation via Machine Learning (PCGML) refers to systems where a PCGML agent and a human work together to produce output content. One of the limitations of co-creative PCGML is that it requires co-creative training data for a PCGML agent to learn to interact with humans. However, acquiring this data is a difficult and time-consuming process. In this work, we propose approximating human-AI interaction data and employing transfer learning to adapt learned co-creative knowledge from one game to a different game. We explore this approach for co-creative Zelda dungeon room generation.",
      "keywords": "datasets; neural networks; transfer learning; co-creative pcg",
      "citation": "@inproceedings{zhou2021toward,  title={Toward Co-Creative Dungeon Generation via Transfer Learning}, author={Zisen Zhou and Matthew Guzdial}, booktitle={Proceedings of the FDG workshop on Procedural Content Generation}, year={2021}}"
    },
    {
      "title": "10 Years of the PCG workshop: Past and Future Trends",
      "year": 2020,
      "authors": "Antonios Liapis",
      "abstract": "As of 2020, the international workshop on Procedural Content Gen-eration enters its second decade. The annual workshop, hosted by the international conference on the Foundations of Digital Games, has collected a corpus of 95 papers published in its first 10 years. This paper provides an overview of the workshop’s activities and surveys the prevalent research topics emerging over the years.",
      "keywords": "procedural content generation, academic topics, survey",
      "citation": "@inproceedings{liapis2020years,  title={10 Years of the PCG workshop: Past and Future Trends},  author={Antonios Liapis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "M.I.N.U.E.T.: Procedural Musical Accompaniment for Textual Narratives",
      "year": 2020,
      "authors": "Mehak Maniktala, Chris Miller, Aaron Margolese-Malin, Arnav Jhala, and Chris Martens",
      "abstract": "Extensive research has been conducted on using procedural music generation in real-time applications such as accompaniment to musicians, visual narratives, and games. However, less attention has been paid to the enhancement of textual narratives through music. In this paper, we present Mood Into Note Using Extracted Text (MINUET), a novel system that can procedurally generate music for textual narrative segments using sentiment analysis. Textual analysis of the flow and sentiment derived from the text is used as input to condition accompanying music. Music generation systems have addressed variations through changes in sentiment. By using an ensemble predictor model to classify sentences as belonging to particular emotions, MINUET generates text-accompanying music with the goal of enhancing a reader’s experience beyond the limits of the author’s words. Music is played via the JMusic library and a set of Markov chains specific to each emotion with mood classifications evaluated via stratified 10-fold cross validation. The development of MINUET affords the reflection and analysis of features that affect the quality of generated musical accompaniment for text. It also serves as a sandbox for further evaluating sentiment-based systems on both text and music generation sides in a coherent experience of an implemented and extendable experiential artifact.",
      "keywords": "procedural content generation, music generation, mood classification, sentiment analysis, narrative experience",
      "citation": "@inproceedings{maniktala2020minuet,  title={M.I.N.U.E.T.: Procedural Musical Accompaniment for Textual Narratives},  author={Mehak Maniktala and Chris Miller and Aaron Margolese-Malin and Arnav Jhala and Chris Martens},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "Multi-Objective Level Generator Generation with Marahel",
      "year": 2020,
      "authors": "Ahmed Khalifa and Julian Togelius",
      "abstract": "This paper introduces a new system to design constructive level generators by searching the space of constructive level generators defined by Marahel language. We use NSGA-II, a multi-objective optimization algorithm, to search for generators for three different problems (Binary, Zelda, and Sokoban). We restrict the representation to a subset of Marahel language to push the evolution to find more efficient generators. The results show that the generated generators were able to achieve good performance on most of the fitness functions over these three problems. However, on Zelda and Sokoban they tend to depend on the initial state than modifying the map.",
      "keywords": "level generation, multi-objective optimization, procedural content generation, level design",
      "citation": "@inproceedings{khalifa2020multiobjective,  title={Multi-Objective Level Generator Generation with Marahel},  author={Ahmed Khalifa and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "Procedural Content Generation of Puzzle Games using Parameterized Generative Adversarial Networks",
      "year": 2020,
      "authors": "Andreas Hald, Jens Struckmann Hansen, Paolo Burelli, and Jeppe Kristensen",
      "abstract": "In this article, we present an experimental approach to using parameterized Generative Adversarial Networks (GANs) to produce levels for the puzzle game Lily's Garden. We extract two condition-vectors from the real levels in an effort to control the details of the GAN's outputs. While the GANs performs well in approximating the first condition (map-shape), they struggle to approximate the second condition (piece distribution). We hypothesize that this might be improved by trying out alternative architectures for both the Generator and Discriminator of the GANs.",
      "keywords": "procedural content generation, conditional generative adversarial networks, puzzle games",
      "citation": "@inproceedings{hald2020procedural,  title={Procedural Content Generation of Puzzle Games using Parameterized Generative Adversarial Networks},  author={Andreas Hald and Jens Struckmann Hansen and Paolo Burelli and Jeppe Kristensen},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "Procedural Generation of Interactive Stories using Language Models",
      "year": 2020,
      "authors": "Jonas Freiknecht and Wolfgang Effelsberg",
      "abstract": "In this paper we introduce an architecture, an implementation and an evaluation of a system for the automatic creation of interactive stories for games. Our goal is to algorithmically create a branched story for the entire game; in each game run a different variant is generated. The architecture uses natural language processing (NLP) to generate meaningful stories. For NLP we use a statistical language model based on a neural network (Generative Pretrained Transformer, GPT-2). The basic architecture generates stories with too many characters which tend to get incoherent for longer texts, so we add a component restricting the number of persons and improving the consistency. The system is initialized with a hand-written game introduction that defines the main characters and the inventory; it also sets the goals for the game. From that text the remainder of the game story is generated algorithmically. We have fully implemented our system, and we report initial, encouraging experimental results.",
      "keywords": "procedural content generation, interactive stories, language models, natural language processing",
      "citation": "@inproceedings{freiknecht2020procedural,  title={Procedural Generation of Interactive Stories using Language Models},  author={Jonas Freiknecht and Wolfgang Effelsberg},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "Procedural Generation using Quantum Computation",
      "year": 2020,
      "authors": "James Wootton",
      "abstract": "Quantum computation is an emerging technology that promises to be a powerful tool in many areas. Though some years likely still remain until significant quantum advantage is demonstrated, the development of the technology has led to a range of valuable resources. These include publicly available prototype quantum hardware, advanced simulators for small quantum programs and programming frameworks to test and develop quantum software. In this provocation paper we seek to demonstrate that these resources are sufficient to provide the first useful results in the field of procedural generation. This is done by introducing a proof-of-principle method: a quantum generalization of a blurring process, in which quantum interference is used to provide a unique effect. Through this we hope to show that further developments in the technology are not required before it becomes useful for procedural generation. Rather, fruitful experimentation with this new technology can begin now.",
      "keywords": "procedural generation, quantum computing",
      "citation": "@inproceedings{wootton2020procedural,  title={Procedural Generation using Quantum Computation},  author={James Wootton},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "Sequential Segment-based Level Generation and Blending using Variational Autoencoders",
      "year": 2020,
      "authors": "Anurag Sarkar and Seth Cooper",
      "abstract": "Existing methods of level generation using latent variable models such as VAEs and GANs do so in segments and produce the final level by stitching these separately generated segments together. In this paper, we build on these methods by training VAEs to learn a sequential model of segment generation such that generated segments logically follow from prior segments. By further combining the VAE with a classifier that determines whether to place the generated segment to the top, bottom, left or right of the previous segment, we obtain a pipeline that enables the generation of arbitrarily long levels that progress in any of these four directions and are composed of segments that logically follow one another. In addition to generating more coherent levels of non-fixed length, this method also enables implicit blending of levels from separate games that do not have similar orientation. We demonstrate our approach using levels from Super Mario Bros., Kid Icarus and Mega Man, showing that our method produces levels that are more coherent than previous latent variable-based approaches and are capable of blending levels across games.",
      "keywords": "procedural content generation, variational autoencoder, level generation, level blending, game blending, pcgml",
      "citation": "@inproceedings{sarkar2020segmentbased,  title={Sequential Segment-based Level Generation and Blending using Variational Autoencoders},  author={Anurag Sarkar and Seth Cooper},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "Spatial Layout of Procedural Dungeons Using Linear Constraints and SMT Solvers",
      "year": 2020,
      "authors": "Jim Whitehead",
      "abstract": "Dungeon generation is among the oldest problems in procedural content generation. Creating the spatial aspects of a dungeon requires three steps: random generation of rooms and sizes, placement of these rooms inside a fixed area, and connecting rooms with passageways. This paper uses a series of integer linear constraints, solved by a satisfiability modulo theories (SMT) solver, to performthe placement step. Separation constraints ensure dungeon rooms do not intersect and maintain a minimum fixed separation. Designers can specify control lines, and dungeon rooms will be placed within a fixed distance of these control lines. Generation timesvary with number of rooms and constraints, but are often very fast. Spatial distribution of solutions tend to have hot spots, but issurprisingly uniform given the underlying complexity of the solver. The approach demonstrates the effectiveness of a declarative approach to dungeon layout generation, where designers can express desired intent, and the SMT solver satisfies this if possible.",
      "keywords": "procedural content generation, dungeon generation, rectangle packing, linear constraints, satisfiability modulo theories, smt",
      "citation": "@inproceedings{whitehead2020spatial,  title={Spatial Layout of Procedural Dungeons Using Linear Constraints and SMT Solvers},  author={Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "Tabletop Roleplaying Games as Procedural Content Generators",
      "year": 2020,
      "authors": "Matthew Guzdial, Devi Acharya, Max Kreminski, Mike Cook, Mirjam Eladhari, Antonios Liapis, and Anne Sullivan",
      "abstract": "Tabletop roleplaying games (TTRPGs) and procedural content generators can both be understood as systems of rules for producing content. In this paper, we argue that TTRPG design can usefully be viewed as procedural content generator design. We present several case studies linking key concepts from PCG research – including possibility spaces, expressive range analysis, and generative pipelines – to key concepts in TTRPG design. We then discuss the implications of these relationships and suggest directions for future work uniting research in TTRPGs and PCG.",
      "keywords": "games, roleplaying games, storytelling, procedural content generation, generative methods",
      "citation": "@inproceedings{guzdial2020roleplaying,  title={Tabletop Roleplaying Games as Procedural Content Generators},  author={Matthew Guzdial and Devi Acharya and Max Kreminski and Mike Cook and Mirjam Eladhari and Antonios Liapis and Anne Sullivan},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2020}}"
    },
    {
      "title": "A Generalized Semantic Representation for Procedural Generation of Rooms",
      "year": 2019,
      "authors": "J. Timothy Balint and Rafael Bidarra",
      "abstract": "Procedural generation of rooms aims to create virtual environments that mimic common patterns found in real-world indoor locations, like offices or bedrooms. Graph-based models (e.g. factor graphs or Bayesian networks) have often been used to represent typical location’s objects and their occurrence likelihood (nodes), as well as their inter-relationships (edges). Previous methods have struggled to represent object semantics in their graph nodes; specifically, they fail to fully and effectively support notions as abstractions (e.g. generic seat instead of chair) and replication (e.g. cups instead of cup). We propose a generalized representation and use for object semantics that overcomes the above limitations of graph-based models in the procedural generation of rooms. This node representation handles semantics as attributes, and clearly distinguishes the contribution of the attributes on the node from the potential effects of the node on the whole graph. We illustrate the additional expressive power of the resulting graph-based model for room generation, and show that it subsumes previous models as particular cases.",
      "keywords": "procedural content generation, data representation, 3d content generation",
      "citation": "@inproceedings{balint2019generlized,  title={A Generalized Semantic Representation for Procedural Generation of Rooms},  author={J. Timothy Balint and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Addressing the Fundamental Tension of PCGML with Discriminative Learning",
      "year": 2019,
      "authors": "Isaac Karth and Adam M. Smith",
      "abstract": "Procedural content generation via machine learning (PCGML) is typically framed as the task of fitting a generative model to full-scale examples of a desired content distribution. This approach presents a fundamental tension: the more design effort expended to produce detailed training examples for shaping a generator, the lower the return on investment from applying PCGML in the first place. In response, we propose the use of discriminative models, which capture the validity of a design rather the distribution of the content, trained on positive and negative example design fragments. Through a modest modification of WaveFunctionCollapse, a commercially-adopted PCG approach that we characterize as using elementary machine learning, we demonstrate a new mode of control for learning-based generators. We demonstrate how an artist might craft a focused set of additional positive and negative design fragments by critique of the generator’s previous outputs. This interaction mode bridges PCGML with mixed-initiative design assistance tools by working with a machine to define a space of valid designs rather than just one new design.",
      "keywords": "machine learning, mixed-initiative interface, design tools, constraint solving, procedural content generation, pgcml, procedural content generation machine learning",
      "citation": "@inproceedings{karth2019addressing,  title={Addressing the Fundamental Tension of PCGML with Discriminative Learning},  author={Isaac Karth and Adam M. Smith},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Anarchy: A Library for Incremental Chaos",
      "year": 2019,
      "authors": "Peter Mawhorter",
      "abstract": "Pseudo-random number generators are ubiquitous components of content generation systems, because their outputs are difficult to predict but also repeatable given an initial seed. These properties make them especially useful as the basis for “random” decisions during a generative process, as they allow the process to be chaotic but also repeatable. This paper describes an open-source family of pseudo-random algorithms which allow for shuffling and distributing items in a reversible and incremental manner. To demonstrate the applicability of these algorithms, I show how they have been used in the creation of a word-search game which includes strong guarantees about the distribution of words that can be discovered.",
      "keywords": "generative algorithms, computational creativity, pseudo-random number generation, noise functions, chaos, procedural content generation",
      "citation": "@inproceedings{mawhorter2019anarchy,  title={Anarchy: A Library for Incremental Chaos},  author={Peter Mawhorter},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Cozy Mystery Construction Kit: Prototyping Toward an AI-Assisted Collaborative Storytelling Mystery Game",
      "year": 2019,
      "authors": "Max Kreminski, Devi Acharya, Nick Junius, Elisabeth Oliver, Kate Compton, Melanie Dickinson, Cyril Focht, Stacey Mason, Stella Mazeika, and Noah Wardrip-Fruin",
      "abstract": "This paper presents a case study in the experience-first prototyping of a generative game. Our goal in this process was to create a PCG-based mystery story construction game ncentered on a social simulation of characters and their motivations, and driven by a set of core themes and experiences we wanted players to encounter. In pursuit of this goal, we created a series of prototypes to test how a variety of generative and AI-based techniques—including character generation, character action suggestion based on game state, story sifting, and social simulation—may be used in support of collaborative storytelling. In this paper we catalogue these prototypes and what we have learned by creating them, detailing design elements we found to be successful in supporting player creativity and that may be useful to the developers of similar games and experiences going forward.",
      "keywords": "co-creativity, player creativity, prototyping, design patterns, collaborative storytelling, tabletop games, ai-based game design, pcg-based game design",
      "citation": "@inproceedings{kreminski2019mystery,  title={Cozy Mystery Construction Kit: Prototyping Toward an AI-Assisted Collaborative Storytelling Mystery Game},  author={Max Kreminski and Devi Acharya and Nick Junius and Elisabeth Oliver and Kate Compton and Melanie Dickinson and Cyril Focht and Stacey Mason and Stella Mazeika and Noah Wardrip-Fruin},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Design-Centric Maze Generation",
      "year": 2019,
      "authors": "Paul Hyunjin Kim, Jacob Grove, Skylar Wurster, and Roger Crawfis",
      "abstract": "A maze is a common structure in a game level. When we design game levels having a different purpose of each level, we may desire mazes with different topological properties, such as lots of branches or long straight-ways. Thus, we need the ability to design mazes based on our game mechanics. In this paper, we introduce our design-centric maze generation in which designers can input their desired properties to create their own mazes. Our method also enables the designers to control the topology of the solution path of a maze. Additionally, this method can provide several mazes which satisfy the given desired properties allowing designers to choose the best maze and use it to build game content for a game level. To demonstrate how useful our design-centric method is, this paper provides several use-cases of building actual game levels and shows that we can design the levels effectively using our method.",
      "keywords": "perfect maze, maze generation, topological properties of maze, search-based procedural content generation",
      "citation": "@inproceedings{kim2019designcentric,  title={Design-Centric Maze Generation},  author={Paul Hyunjin Kim and Jacob Grove and Skylar Wurster and Roger Crawfis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Generators that Read",
      "year": 2019,
      "authors": "Max Kreminski, Isaac Karth, and Noah Wardrip-Fruin",
      "abstract": "Most discussions of procedural content generation have focused primarily on the artifacts that generators produce or the process by which these artifacts are created. Less focus, however, has been placed on the methods by which generators interpret their input. Many generators take complex input, act as part of a generative pipeline,arepartofamixed-initiativecommunicationwiththeuser, or otherwise need to take context into account during generation. In these cases, the process by which the generator reads and makes sense of its input is often just as interesting as the process by which it produces an output artifact. It is worthwhile to take a closer look at how generators read. Via a case study of two erasure poetry generators, we propose the concept of a generativist reading: a process of reading that produces generative models. Many existing generators have dual input/output or reading/writing processes that are presented as a monolithic unit, but our understanding of both processes and results is enriched when we clearly distinguish between how generators write and how they read.",
      "keywords": "procedural content generation, reading, generative pipelines, close reading, context-sensitive generation, mixed-initiative co-creativity, generativist readings,erasure poetry generation, proceduralist readings",
      "citation": "@inproceedings{kreminski2019generators,  title={Generators that Read},  author={Max Kreminski and Isaac Karth and Noah Wardrip-Fruin},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Organic Building Generation in Minecraft",
      "year": 2019,
      "authors": "Michael Cerny Green, Christoph Salge, and Julian Togelius",
      "abstract": "This paper presents a method for generating floor plans for structures in Minecraft (Mojang 2009). Given a 3D space, it will auto-generate a building to fill that space using a combination of constrained growth and cellular automata. The result is a series of organic-looking buildings complete with rooms, windows, and doors connecting them. The method is applied to the Generative Design in Minecraft (GDMC) competition to auto-generate buildings in Minecraft, and the results are discussed.",
      "keywords": "pcg, artificial intelligence, minecraft",
      "citation": "@inproceedings{green2019building,  title={Organic Building Generation in Minecraft},  author={Michael Cerny Green and Christoph Salge and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Stories of the Town: Balancing Character Autonomy and Coherent Narrative in Procedurally Generated Worlds",
      "year": 2019,
      "authors": "Chris Miller, Mayank Dighe, Chris Martens, and Arnav Jhala",
      "abstract": "Procedural narrative generation systems often focus on autonomous agent based simulations to create emergent interactions, plan-based approaches to provide guarantees for coherence, or using elements of simulation to guide plan-based approaches. These different approaches, with some exceptions, tend to trade off character autonomy in service of more designer controlled experiences or content authoring in service of encoding domain knowledge of possible branches of the narrative and participating characters. We have developed a system, called Stories of the Town, that automatically generates narratives by synthesizing three distinct approaches to traditional narrative generation: context-free grammars, planning, and simulation. More specifically, our system generates narratives via probabilistic context-free grammars applied to state-space planning problem solutions from planning problem formulations of simulated character models. Our system uses character simulations to generate variety in narratives and ensures narrative coherence through authoring probabilistic context-free grammars. By doing so, this system takes advantage of the strengths of each individual approach (e.g. controllability, scalability, intentionality, and variety) to generate narratives that are extensible, expressive, consistent with simulated character personalities and histories, and controllable. We show that this system has strong potential in automatically generating varied, complex, consistent, and goal-oriented narratives. Further development of the system will allow for more efficient utilization of the strengths of each narrative generation approach while also using these strengths to supplement their individual shortcomings.",
      "keywords": "",
      "citation": "@inproceedings{miller2019stories,  title={Stories of the Town: Balancing Character Autonomy and Coherent Narrative in Procedurally Generated Worlds},  author={Chris Miller and Mayank Dighe and Chris Martens and Arnav Jhala },  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "TownSim: Agent-based city evolution for naturalistic road network generation",
      "year": 2019,
      "authors": "Asiiah Song and Jim Whitehead",
      "abstract": "We describe an agent-based city evolution algorithm creating road networks over time, and explore several approaches for analyzing the malleability of the algorithm to exposed parameters. In addition to qualitatively assessing the generated content, we look at the directionality, connectivity, and curvature of the generated road networks.",
      "keywords": "road network generation, virtual city generation",
      "citation": "@inproceedings{song2019agentbased,  title={TownSim: Agent-based city evolution for naturalistic road network generation},  author={Asiiah Song and Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Two-step Constructive Approaches for Dungeon Generation",
      "year": 2019,
      "authors": "Michael Cerny Green, Ahmed Khalifa, Athoug Alsoughayer, Divyesh Surana, Antonios Liapis, and Julian Togelius",
      "abstract": "This paper presents a two-step generative approach for creating dungeons in the rogue-like puzzle game MiniDungeons 2. Generation is split into two steps, initially producing the architectural layout of the level as its walls and floor tiles, and then furnishing it with game objects representing the player’s start and goal position, challenges and rewards. Three layout creators and three furnishers are introduced in this paper, which can be combined in different ways in the two-step generative process for producing diverse dungeons levels. Layout creators generate the floors and walls of a level, while furnishers populate it with monsters, traps, and treasures. We test the generated levels on several expressivity measures, and in simulations with procedural persona agents.",
      "keywords": "procedural content generation, level generation, automated game playing, expressive range analysis",
      "citation": "@inproceedings{green2019constructive,  title={Two-step Constructive Approaches for Dungeon Generation},  author={Michael Cerny Green and Ahmed Khalifa and Athoug Alsoughayer and Divyesh Surana and Antonios Liapis and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2019}}"
    },
    {
      "title": "Evolving Maps and Decks for Ticket to Ride",
      "year": 2018,
      "authors": "Fernando de Mesentier Silva, Scott Lee, Julian Togelius, and Andy Nealen",
      "abstract": "We present a search-based approach to generating boards and decks of cards for the game Ticket to Ride. Our evolutionary algorithm searches for boards that allow for a well-shaped game arc, and for decks that promote an equal distribution of desirability for cities. We show examples of two boards generated by our algorithm and compare our results to those of the actual components of the game. Our approach creates game content that is specifically designed towards metrics that can affect gameplay in an impactful way.",
      "keywords": "procedural content generation, board games, evolutionary algorithm",
      "citation": "@inproceedings{silva2018evolving,  title={Evolving Maps and Decks for Ticket to Ride},  author={Fernando de Mesentier Silva and Scott Lee and Julian Togelius and Andy Nealen},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "Fostering Creativity in the Mixed-Initiative Evolutionary Dungeon Designer",
      "year": 2018,
      "authors": "Alberto Alvarez, Steve Dahlskog, Jose Font, Johan Holmberg, Chelsi Nolasco, and Axel Österman",
      "abstract": "Mixed-initiative systems highlight the collaboration between humans and computers in fostering the generation of more interesting content in game design. In light of the ever-increasing cost of game development, providing mixed-initiative tools can not only significantly reduce the cost but also encourage more creativity amongst game designers. The Evolutionary Dungeon Designer (EDD) is a mixed-initiative tool with a focus on using evolutionary computation to procedurally generate content that adhere to game design patterns. As part of an ongoing project, feedback from a user study on EDD’s capabilities as a mixed-initiative design tool pointed out the need for improvement on the tool’s functionalities. In this paper we present a review of the principles of the mixed- initiative model, as well as the existing approaches that implement it. The outcome of this analysis allows us to address the appointed needs for improvement by shaping a new version of EDD that we describe here. Finally, we also present the results from a user study carried out with professional game developers, in order to assess EDD’s new functionalities. Results show an overall positive evaluation of the tool’s intuitiveness and capabilities for empow- ering game developers’ creative skills during the design process of dungeons for adventure games. They also allow us to identify upcoming challenges pattern-based mixed-initiative tools could benefit from.",
      "keywords": "mixed-initiative design, procedural content generation, game design patterns",
      "citation": "@inproceedings{alvarez2018creativity,  title={Fostering Creativity in the Mixed-Initiative Evolutionary Dungeon Designer},  author={Alberto Alvarez and Steve Dahlskog and Jose Font and Johan Holmberg and Chelsi Nolasco and Axel Österman},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "Generating Levels That Teach Mechanics",
      "year": 2018,
      "authors": "Michael Cerny Green, Ahmed Khalifa, Gabriella A. B. Barros, Andy Nealen, and Julian Togelius",
      "abstract": "The automatic generation of game tutorials is a challenging AI problem. While it is possible to generate annotations and instructions that explain to the player how the game is played, this paper focuses on generating a gameplay experience that introduces the player to a game mechanic. It evolves small levels for the Mario AI Framework that can only be beaten by an agent that knows how to perform specific actions in the game. It uses variations of a perfect A* agent that are limited in various ways, such as not being able to jump high or see enemies, to test how failing to do certain actions can stop the player from beating the level.",
      "keywords": "super mario bros, search based level generation, feasible infeasible 2-population",
      "citation": "@inproceedings{green2018generating,  title={Generating Levels That Teach Mechanics},  author={Michael Cerny Green and Ahmed Khalifa and Gabriella A. B. Barros and Andy Nealen and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "Generative Design in Minecraft (GDMC): Settlement Generation Competition",
      "year": 2018,
      "authors": "Christoph Salge, Michael Cerny Green, Rodgrigo Canaan, and Julian Togelius",
      "abstract": "This paper introduces the settlement generation competition for Minecraft, the first part of the Generative Design in Minecraft challenge. The settlement generation competition is about creating Artificial Intelligence (AI) agents that can produce functional, aesthetically appealing and believable settlements adapted to a given Minecraft map—ideally at a level that can compete with human created designs. The aim of the competition is to advance procedural content generation for games, especially in overcoming the challenges of adaptive and holistic PCG. The paper introduces the technical details of the challenge, but mostly focuses on what challenges this competition provides and why they are scientifically relevant.",
      "keywords": "competition, generative design, procedural content generation, minecraft",
      "citation": "@inproceedings{salge2018generative,  title={Generative Design in Minecraft (GDMC): Settlement Generation Competition},  author={Christoph Salge and Michael Cerny Green and Rodgrigo Canaan and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "Graph-based Generation of Action-Adventure Dungeon Levels using Answer Set Programming",
      "year": 2018,
      "authors": "Thomas Smith, Julian Padget, and Andrew Vidler",
      "abstract": "The construction of dungeons in typical action-adventure computer games entails composing a complex arrangement of structural and temporal dependencies. It is not simple to generate dungeons with correct lock-and-key structures. In this paper we sketch a controllable approach to building graph-based models of acyclic dungeon levels via declarative constraint solving, that is capable of satisfying a range of hard gameplay and design constraints. We use a quantitative expressive range analysis to characterise the initial output of the system, present an example of the degree to which the output may be altered, and show a comparison with an alternate approach.",
      "keywords": "procedural content generation, generative methods, answer set programming, expressive range",
      "citation": "@inproceedings{smith2018graphbased,  title={Graph-based Generation of Action-Adventure Dungeon Levels using Answer Set Programming},  author={Thomas Smith and Julian Padget and Andrew Vidler},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "Measuring Quality of Grammars for Procedural Level Generation",
      "year": 2018,
      "authors": "Riemer van Rozen and Qinten Heijn",
      "abstract": "Grammar-based procedural level generation raises the productivity of level designers for games such as dungeon crawl and platform games. However, the improved productivity comes at cost of level quality assurance. Authoring, improving and maintaining grammars is difcult because it is hard to predict how each grammar rule impacts the overall level quality, and tool support is lacking. We propose a novel metric called Metric of Added Detail (MAD) that indicates if a rule adds or removes detail with respect to its phase in the transformation pipeline, and Specifcation Analysis Reporting (SAnR) for expressing level properties and analyzing how qualities evolve in level generation histories. We demonstrate MAD and SAnR using a prototype of a level generator called Ludoscope Lite. Our preliminary results show that problematic rules tend to break SAnR properties and that MAD intuitively raises fags. MAD and SAnR augment existing approaches, and can ultimately help designers make beter levels and level generators.",
      "keywords": "game development, level design, pcg, automated game design, grammars, quality, metrics, domain-specifc languages",
      "citation": "@inproceedings{rozen2018measuring,  title={Measuring Quality of Grammars for Procedural Level Generation},  author={Riemer van Rozen and Qinten Heijn},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "Pairing Character Classes in a Deathmatch Shooter Game via a Deep-Learning Surrogate Model",
      "year": 2018,
      "authors": "Daniel Karavolos, Antonios Liapis, and Georgios N. Yannakakis",
      "abstract": "This paper introduces a surrogate model of gameplay that learns the mapping between different game facets, and applies it to a generative system which designs new content in one of these facets. Focusing on the shooter game genre, the paper explores how deep learning can help build a model which combines the game level structure and the game’s character class parameters as input and the gameplay outcomes as output. The model is trained on a large corpus of game data from simulations with artificial agents in random sets of levels and class parameters. The model is then used to generate classes for specific levels and for a desired game outcome, such as balanced matches of short duration. Findings in this paper show that the system can be expressive and can generate classes for both computer generated and human authored levels.",
      "keywords": "procedural content generation, surrogate model, deep learning, evolutionary computation, shooter games",
      "citation": "@inproceedings{karavolos2018character,  title={Pairing Character Classes in a Deathmatch Shooter Game via a Deep-Learning Surrogate Model},  author={Daniel Karavolos and Antonios Liapis and Georgios N. Yannakakis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "Tarot-Based Narrative Generation",
      "year": 2018,
      "authors": "Anne Sullivan, Mirjam Palosaari Eladhari, and Michael Cook",
      "abstract": "Tarot has been used for centuries as a method to give structure to storytelling, both in game and fortune-telling settings. As such, tarot cards have developed over time, expanding the symbolism and depth of meaning associated with each card. This provides a corpus for a large number of possible stories, making tarot a rich area of exploration for story generation. Therefore, we have created a tarot-based narrative generation system that creates short movie-like story synopses, along with a tagline one might see on a movieposter.This project is in early development; we have created a prototype as a proof of concept. The project exists as a webpage that an interactor can use to draw new tarot cards for the story spread (card layout) and generate new stories from them. In this paper we discuss the details of our system and describe more details about the tarot as a corpus. We also discuss future areas of exploration based on our proof of concept.",
      "keywords": "game narrative, procedural generation, card games, story games, tarot",
      "citation": "@inproceedings{sullivan2018tarotbased,  title={Tarot-Based Narrative Generation},  author={Anne Sullivan and Mirjam Palosaari Eladhari and Michael Cook},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "‘Play Your Own Way’ Adapting a Procedural Framework for Accessibility",
      "year": 2018,
      "authors": "Tommy Tompson and Mathew Syret",
      "abstract": "Sure Footing is a research project cum commercial product that arose from exploring generative systems for infinite runner games that balanced procedural fexibility with authorial intent. Te approach taken as part of the games level generation systems allows not only for the gradual increase in difculty as players progress, but allow for specifc confgurations that allow for the unique confgurations that embody a level of difculty or challenge. Tis paper explores ongoing development of the generation framework to to enable this fexibility, as well as raise consideration for fexible generation in the context of accessibility for players of varying competencies.",
      "keywords": "game design, procedural content generation, video games, level generation",
      "citation": "@inproceedings{tompson2018‘play,  title={‘Play Your Own Way’ Adapting a Procedural Framework for Accessibility},  author={Tommy Tompson and Mathew Syret },  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2018}}"
    },
    {
      "title": "A semantic approach to patch-based procedural generation of urban road networks",
      "year": 2017,
      "authors": "Edward Teng and Rafael Bidarra",
      "abstract": "A road network is one of the core elements of urban environments, strongly defining their layout. Procedural modeling has been increasingly used to create such road networks. However, many procedural methods are complex and difficult to master by non-experts, often have a limited and hard-to-control expressive range, and require a variety of specialized input data to generate a complex road network. To mitigate this, some methods proposed to use stochastic data on road patches extracted from example maps to design a road network following a given urban style. We propose a novel patch-based method that uses the semantics of individual patches to help guiding the procedural generation. Our approach combines the advantages of patch-based generation with those of conventional parametric methods. Due to the intuitive character of semantic parameters and tags, our approach provides for an easy customization of fictive road network creation, allowing a user to easily define various types of road network styles, containing only the desired features and structures of real-world road networks.",
      "keywords": "patch-based network generation, urban modeling, procedural content generation",
      "citation": "@inproceedings{teng2017semntic,  title={A semantic approach to patch-based procedural generation of urban road networks},  author={Edward Teng and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "Art and Science of Engineered Design: What Kind of Discipline is PCG?",
      "year": 2017,
      "authors": "Jim Whitehead",
      "abstract": "What kind of discipline is PCG? PCG research can be viewed as science, engineering, design, and art. PCG is thus a multidiscipline, drawing from a broad set of epistemic traditions.",
      "keywords": "philosophy of procedural content generation, philosophy of science",
      "citation": "@inproceedings{whitehead2017art,  title={Art and Science of Engineered Design: What Kind of Discipline is PCG?},  author={Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "Eficiency, Realism, and Representation in Generated Content: A Case Study using Family Tree Generation",
      "year": 2017,
      "authors": "Peter Mawhorter",
      "abstract": "Work on procedural content generation ofen centers game mechanics and visual/audio aesthetics, whereas the generation of social structures has not received the same atention, despite potentially enabling new forms of gameplay. When the generation of social and/or cultural content is atempted, tensions naturally arise between algorithmic efciency, realism, and representation. A specifc algorithm for generating family trees is used as a case study for these issues, with the hope that this can stimulate broader discussion in the community.",
      "keywords": "procedural content generation, representation, relationships",
      "citation": "@inproceedings{mawhorter2017eficiency,,  title={Eficiency, Realism, and Representation in Generated Content: A Case Study using Family Tree Generation},  author={Peter Mawhorter},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "Learning the Paterns of Balance in a Multi-Player Shooter Game",
      "year": 2017,
      "authors": "Daniel Karavolos, Antonios Liapis, and Georgios Yannakakis",
      "abstract": "A particular challenge of the game design process is when the de- signer is requested to orchestrate dissimilar elements of games such as visuals, audio, narrative and rules to achieve a specifc play experience. Within the domain of adversarial first-person shooter games, for instance, a designer must be able to comprehend the diferences between the weapons available in the game, and appropriately craf a game level to take advantage of strengths and weaknesses of those weapons. As an initial study towards computationally orchestrating dissimilar content generators in games, this paper presents a computational model which can classify a matchup of a team-based shooter game as balanced or as favoring one or the other team. Te computational model uses convolutional neural networks to learn how game balance is afected by the level, represented as an image, and each team’s weapon parameters. Te model was trained on a corpus of over 50,000 simulated games with artifcial agents on a diverse set of levels created by 39 diferent generators. Te results show that the fusion of levels, when processed by a convolutional neural network, and weapon parameters yields an accuracy far above the baseline but also improves accuracy compared to artificial neural networks or models which use partial information, such as only the weapon or only the level as input.",
      "keywords": "automated playtesting, deep learning, shooter games, level patterns, procedural content generation, game balancing",
      "citation": "@inproceedings{karavolos2017learning,  title={Learning the Paterns of Balance in a Multi-Player Shooter Game},  author={Daniel Karavolos and Antonios Liapis and Georgios Yannakakis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "Litle Procedural People: Playing politics with generators",
      "year": 2017,
      "authors": "Kate Compton",
      "abstract": "Do generators have politics? What about generators that generate around people, with people, or even create generative people. This paper proposes four initial sites of inquiry that deserve further atention from this community, or at least those members who fnd themselves building a person-generator: characters who engage socially with people, generators which make use of data created by or about people, the use of cultural and social signifers in generators, and simulations or models which represent people.",
      "keywords": "generativity, prototyping, interaction design, ethics",
      "citation": "@inproceedings{compton2017procedural,  title={Litle Procedural People: Playing politics with generators},  author={Kate Compton},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "On Using Graph Partitioning with Isomorphism Constraint in Procedural Content Generation",
      "year": 2017,
      "authors": "Ahmed M. Abuzuraiq",
      "abstract": "This paper describes an algorithm to solve the problem of partitioning a planar graph with a constraint on which partitions should be adjacent or nonadjacent. We explore the applications of the algorithm in Procedural Content Generation in games which includes: the generation of political maps, distribution of terrain and converting or linking Mission Graphs to game spaces. We solve this problem using A-Star search with a heuristic for measuring graphs similarity and we suggest techniques such as graph coarsening to limit the search space. The algorithm sensitivity to the initial state is analyzed next and a restart policy is suggested to overcome that. Additionally, we present multiple constraints that can aid in better controlling the outcomes of the algorithm and we show how these constraints can help in the implementation of the displayed applications.",
      "keywords": "games, procedural content generation, a-star search, graph isomorphism, graph partitioning, quotient graph, isospectrality, graph coarsening, political maps, mission graph, restart policy",
      "citation": "@inproceedings{abuzuraiq2017using,  title={On Using Graph Partitioning with Isomorphism Constraint in Procedural Content Generation},  author={Ahmed M. Abuzuraiq},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "Subverting Historical Cause & Effect: Generation of Mythic Biographies in Caves of Qud",
      "year": 2017,
      "authors": "Jason Grinblat and C. Brian Bucklew",
      "abstract": "Procedurally generating history is a daunting task. The process of proceduralization requires codifying relationships into rules, and real-lifehistoriesaretanglednetworksofpeople,places,andevents whose complexities obscure their relational mechanics. The task is further complicated by the fact that history serves a rhetorical function, i.e., historical accounts are used to promote certain cultural narratives that can belie the facts they purport to narrativize (this function is routinely neglected in video games’ treatment of history). This paper describes a novel approach for procedurally generating coherent biographical narratives for historical figures, as implemented in our far-future roguelike game Caves of Qud. Using a state machine and replacement grammar as procedural tools, we construct a system that subverts the logic of cause and effect in favor of a process that first generates historical events and rationalizes them ex post facto.",
      "keywords": "qualitative procedural generation; history; myth; narrative generation",
      "citation": "@inproceedings{grinblat2017subverting,  title={Subverting Historical Cause & Effect: Generation of Mythic Biographies in Caves of Qud},  author={Jason Grinblat and C. Brian Bucklew},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "Towards Pattern-Based Mixed-Initiative Dungeon Generation",
      "year": 2017,
      "authors": "Alexander Baldwin, Steve Dahlskog, Jose M. Font, and Johan Holmberg",
      "abstract": "Mixed-initiative Procedural Content Generation uses algorithms to assist human designers in the collaborative creation of game content. Different mixed-initiative approaches use different methods to engage with the design material while supporting the designer’s intentions. However, the designer runs the risk of misunderstand- ing the system’s abilities and how to control them. In order to limit miscommunication during the design process, heuristics could be applied. In this paper we present a mixed-initiative tool for evolving dungeons with the aid of game design patterns as heuristics. The tool, the Evolutionary Dungeon Designer, uses a genetic algorithm that searches for levels containing game design patterns on two hierarchicallevelsofabstractiontoexpressmorecomplexgameplay in the game level. We evaluate the tool through a series of lab experiments and a user study conducted with professional game developers. Our results demonstrate that we are able to control the generation of the different patterns with the aid of design pattern-related input parameters, as well as identifying a number of features a design pattern-based mixed-initiative tool could benefit from.",
      "keywords": "procedural content generation, evolutionary algorithms, game design patterns, mixed-initiative design",
      "citation": "@inproceedings{baldwin2017patternbased,  title={Towards Pattern-Based Mixed-Initiative Dungeon Generation},  author={Alexander Baldwin and Steve Dahlskog and Jose M. Font and Johan Holmberg},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "WaveFunctionCollapse is Constraint Solving in the Wild",
      "year": 2017,
      "authors": "Isaac Karth and Adam M. Smith",
      "abstract": "Maxim Gumin’s WaveFunctionCollapse (WFC) algorithm is an example-driven image generation algorithm emerging from the craft practice of procedural content generation. In WFC, new images are generated in the style of given examples by ensuring every local window of the output occurs somewhere in the input. Operationally, WFC implements a non-backtracking, greedy search method. This paper examines WFC as an instance of constraint solving methods. We trace WFC’s explosive influence on the technical artist community, explain its operation in terms of ideas from the constraint solving literature, and probe its strengths by means of a surrogate implementation using answer set programming.",
      "keywords": "constraint solving, procedural content generation, texture synthesis",
      "citation": "@inproceedings{karth2017wavefunctioncollapse,  title={WaveFunctionCollapse is Constraint Solving in the Wild},  author={Isaac Karth and Adam M. Smith},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "What Do We Value in Procedural Content Generation?",
      "year": 2017,
      "authors": "Gillian Smith",
      "abstract": "Generative systems embody and promote values through their design. This position paper discusses common values in existing PCG systems and suggests alternate, contrasting values that could lead to new kinds of PCG research and practice. There is a need for criticality and awareness of the values we embed in our work, and for consciously reflecting upon our shared values as a community.",
      "keywords": "value-based design, procedural content generation",
      "citation": "@inproceedings{smith2017what,  title={What Do We Value in Procedural Content Generation?},  author={Gillian Smith},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2017}}"
    },
    {
      "title": "Danesh: Helping Bridge The Gap Between Procedural Generators And Their Output",
      "year": 2016,
      "authors": "Michael Cook, Jeremy Gow, and Simon Colton",
      "abstract": "Procedural content generation is more popular than ever among game developers, but understanding, adjusting and perfecting a procedural generator is difficult for newcomers and experts alike. In this paper we present Danesh, an intelligent tool we are building to help developers of all skill levels explore, improve and understand procedural generators. We discuss the structure of the tool, report on the techniques used, and lay out the future of the project.",
      "keywords": "procedural generation, assistive design, computational creativity",
      "citation": "@inproceedings{cook2016danesh,  title={Danesh: Helping Bridge The Gap Between Procedural Generators And Their Output},  author={Michael Cook and Jeremy Gow and Simon Colton},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Diegetically Grounded Evolution of Gameworld Languages",
      "year": 2016,
      "authors": "James Ryan",
      "abstract": "We present perhaps the first exploration of the procedural generation of gameworld languages, meaning fictional languages spoken by characters in a game’s diegesis. This preliminary work takes a simulation-based approach in which languages are represented abstractly, using a vectorial scheme, and evolve over simulated game time as the emergent byproduct of diegetic agent interactions. While this method does not produce concrete languages with surface representations and rules, the abstract vectors that it does produce still provide interesting authorial affordances, which we discuss. Moreover, as an operationalization of linguistic theories, particularly Labov’s incrementation model, we position our work as a potential contribution to the computational modeling of linguistic phenomena.",
      "keywords": "generative methods, simulation-based approaches, computational modeling of language",
      "citation": "@inproceedings{ryan2016diegetically,  title={Diegetically Grounded Evolution of Gameworld Languages},  author={James Ryan},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Do You Like This Art I Made You: Introducing Techne, A Creative Artbot Commune",
      "year": 2016,
      "authors": "Johnathan Pagnutti, Kate Compton, and Jim Whitehead",
      "abstract": "Artbots have found limited fame—from wordplay bots on Twitter with thousands of followers, to bots made to show off the latest machine learning and AI techniques. Such bots may sometimes interact with human input, but almost never interact with other bots. When they do (Madrigal 2014), they do not learn from the other bots. This is a far cry from how realcreativecommunitieswork, wherepractitionerslearnfromsomeoftheircolleaguesand can inform the creative processes of others. What would a community of artbots look like if they could communicate and learn like a community of human artists? In this paper, we present Techne, an agent-based bot-communication platform designed to give artbots the ability to communicate and share artistic practices with each other. We use the grammar-based generation tool Tracery to create art-generating grammars for the bots, and these grammars also serve as a “lingua franca” which allows any bot to understand (and borrow from) another artbot’s generative code. This communication between individual bots enables us to build up the social features we would expect from a “real” artistic community: Techne bots create art to win the approval of other bots in the community, create art that other bots hate but they personally love, and help each other (through sharing art-making “process”) reach some artistic ideal. This paper presents the current work done on building this platform, and some of the lessons we’ve learned from watching the first Techne communities grow and trade art.",
      "keywords": "multi-agent systems, generative methods, computational creativity",
      "citation": "@inproceedings{pagnutti2016you,  title={Do You Like This Art I Made You: Introducing Techne, A Creative Artbot Commune},  author={Johnathan Pagnutti and Kate Compton and Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Exhaustive Exploration Strategies for NPCs",
      "year": 2016,
      "authors": "Muntasir Chowdhury and Clark Verbrugge",
      "abstract": "Automated, exhaustive exploration of game levels is typically based on simple, greedy coverage heuristics, or is directed more at the problem of locating dynamic targets. In this paper, we present and analyze a method for creating an exploratory tour guaranteed to uncover all parts of a 2D map. First, a set of camera points that collectively ensure full coverage are chosen. A tour visiting these cameras is then constructed using navigation graphs and by employing heuristics based on distance and visual coverage. We identify the different factors that affect this methodology through experiments on maps from commercial games. The strategies proposed can be used by both hostile and non-hostile NPCs in different spatial search scenarios that benefit from full coverage, or to help a player uncover a map in fog-of-war settings.",
      "keywords": "artificial intelligence, exploration, agent behaviours",
      "citation": "@inproceedings{chowdhury2016exploration,  title={Exhaustive Exploration Strategies for NPCs},  author={Muntasir Chowdhury and Clark Verbrugge},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Identifying Attributes for Characterizing Game Area Types in Virtual Terrain",
      "year": 2016,
      "authors": "Andrew Pech, Philip Hingston, Martin Masek, and Chiou-Peng Lam",
      "abstract": "A key problem in methods that automatically generate terrain which incorporate game level designs is a lack of quantitative measures that capture common game design elements. In this paper, we investigate a set of graph-connectivity and space-based metrics which can be used to classify area types that are commonly found in video game terrains. We evaluate the significance of each metric in differentiating area types by taking samples from a set of existing game levels with a known set of areas. Lastly, we demonstrate the potential of the metric set by creating classifiers that attempt to determine an areas’ type based on its set of metrics.",
      "keywords": "procedural content, game terrain, virtual terrain, isovist, graph-connectivity",
      "citation": "@inproceedings{pech2016identifying,  title={Identifying Attributes for Characterizing Game Area Types in Virtual Terrain},  author={Andrew Pech and Philip Hingston and Martin Masek and Chiou-Peng Lam},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Procedural Generation of Linguistics, Dialects, Naming Conventions and Spoken Sentences",
      "year": 2016,
      "authors": "Mark R Johnson",
      "abstract": "This exploratory paper on a work-in-progress game development explores the design implementation and thematic and gameplay objectives of a system for the procedural generation of forms of speech, dialects, and even unique idiolects distinctive to in-game individual AI actors. It begins by recounting the development of the five-year ongoing experimental roguelike game project this system was created for, Ultima Ratio Regum (URR), and identifying the literary inspirations behind the project which have strongly informed the in-development language, speech and dialect system. It then notes the importance of what I term “qualitative procedural generation” to this project – the algorithmic creation of cultures, social norms, practices, beliefs, etc – and how these many factors underpin the procedural creation of the game’s dialects for various cultural groups. It then goes into detail about the variation introduced into the speech system, including syllabic and alphabetical variation, the creation of sets of references for each culture dependent upon a culture’s geographic and climatological location and ideological and religious preferences, the procedural generation of names which adhere to different archetypes, and the generation of greetings, insults, farewells and compliments distinctive to each culture. These are in turn combined with variations in sentence complexity which the paper also considers. The paper then offers two sample conversations from the in- development system, and explores the potential of such cultural speech systems for the generation of deep and highly believable virtual worlds, especially in games (such as URR) with an explicit focus upon simulation or worldbuilding. At time of writing this system is two months into a predicted four-month development, and the finished version will be demonstrated at DiGRA-FDG 2016 alongside the presentation of this paper. In keeping with the author’s background in social and political science, not in computer science, this paper focuses upon questions of system design and player experience, rather than the technical specifics of the system’s coding implementation.",
      "keywords": "",
      "citation": "@inproceedings{johnson2016procedural,  title={Procedural Generation of Linguistics, Dialects, Naming Conventions and Spoken Sentences},  author={Mark R Johnson},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Scalable Level Generation for 2D Platforming Games",
      "year": 2016,
      "authors": "Neall Dewsbury, Aimie Nunn, Matthew Syrett, James Tatum, and Tommy Thompson",
      "abstract": "In this paper we present a model for procedural generation of 2D platforming levels, with the aim to ensure content can be scaled as players progress. Levels are generated through use of a two-phased generate and test approach, with the first reliant upon a grammar for generation of activities, while the latter is focussed on the positioning of geometry. These methods are made scalable courtesy of a budget-driven approach that limits the expressiveness of each component. We investigate the effectiveness of this approach and the playable levels it can generate for a 2D ‘infinite runner’ video game.",
      "keywords": "procedural content generation, games, levels, 2d platformers",
      "citation": "@inproceedings{dewsbury2016scalable,  title={Scalable Level Generation for 2D Platforming Games},  author={Neall Dewsbury and Aimie Nunn and Matthew Syrett and James Tatum and Tommy Thompson},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Shopping for Game Mechanics",
      "year": 2016,
      "authors": "Tiago Machado, Ivan Bravi, Zhu Wang, Andy Nealen, and Julian Togelius",
      "abstract": "Recommender systems are very common nowadays, from shopping websites to social networks, from map routing systems to entertainment stream services. We use recommender systems as an inspiration to create an AI Game Design Assisted tool which recommends game elements, such as sprites and mechanics, during the development process. Suggestions are based on similarities between games and freely inspired by game analysis studies. The tool is based on the Video Game Description Language.",
      "keywords": "recommender systems, ai game design assisted tool, game analysis studies",
      "citation": "@inproceedings{machado2016shopping,  title={Shopping for Game Mechanics},  author={Tiago Machado and Ivan Bravi and Zhu Wang and Andy Nealen and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "The VGLC: The Video Game Level Corpus",
      "year": 2016,
      "authors": "Adam James Summerville, Michael Mateas, Sam Snodgrass, and Santiago Ontañón",
      "abstract": "Levels are a key component of many different video games, and a large body of work has been produced on how to procedurally generate game levels. Recently, Machine Learning techniques have been applied to video game level generation towards the purpose of automatically generating levels that have the properties of the training corpus. Towards that end we have made available a corpora of video game levels in an easy to parse format ideal for different machine learning and other game AI research purposes.",
      "keywords": "video games, level design, procedural content generation, machine learning, corpus",
      "citation": "@inproceedings{summerville2016vglc,  title={The VGLC: The Video Game Level Corpus},  author={Adam James Summerville and Michael Mateas and Sam Snodgrass and Santiago Ontañón},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "Towards Procedural Generation As Gameplay: CLAY and Tombs of Tomeria",
      "year": 2016,
      "authors": "Michael Cook and Simon Colton",
      "abstract": "Procedural generation is a popular tool for generating large quantities of content for games, but its function as a mechanic is largely underexplored. In this paper we describe CLAY and Tombs Of Tomeria, two games in which the player can reparameterise a level generator as a means of exploration. We describe the motivation for the work, the design challenges in using procedural generation in this way, and discuss future problems and opportunities with using generative techniques as game mechanics.",
      "keywords": "procedural generation, game design",
      "citation": "@inproceedings{cook2016procedural,  title={Towards Procedural Generation As Gameplay: CLAY and Tombs of Tomeria},  author={Michael Cook and Simon Colton},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2016}}"
    },
    {
      "title": "A Constructive Approach for the Generation of Underwater Environments",
      "year": 2015,
      "authors": "Ryan Abela, Antonios Liapis, and Georgios N. Yannakakis",
      "abstract": "This paper introduces Coralize, a library of generators for marine organisms such as corals and sponges. Using constructive algorithms, Coralize can generate stony corals via L-system grammars, soft corals via leaf venation algorithms and sponges via nutrient-based mesh growth. The generative algorithms are parameterizable, allowing a user to adjust the parameters in order to create visually appealing 3D meshes. Such meshes can be used to automatically populate a seabed or reef, in order to create a biologically realistic and aesthetically pleasing underwater environment.",
      "keywords": "",
      "citation": "@inproceedings{abela2015constructive,  title={A Constructive Approach for the Generation of Underwater Environments},  author={Ryan Abela and Antonios Liapis and Georgios N. Yannakakis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "A Procedural Approach for Infinite Deterministic 2D Grid-Based World Generation",
      "year": 2015,
      "authors": "Tanel Teinemaa, Till Riemer, and Noor Shaker",
      "abstract": "In this paper we introduce a constructive approach for infinite deterministic content generation for 2d grid-based world games. We present our game Crowdbeam and the underlying framework implemented to generate its content. Our approach relies on a generic layer-based framework that eases implementation and future extension. In the current version, the system is composed of four layers that allow real time generation of a wide range of content variations while preserving deterministic outcomes when seeded with the same parameters. We rely on a combination of methods such as agents and Cellular Automata to smooth the content and to handle soft transitions between the parts of the world. We present the framework and the methods used and we discuss the integration into the game. We finally provide a preliminary analysis of the results.",
      "keywords": "procedural content generation, video games, infinite world generation, constructive methods, agent-based methods, cellular automata",
      "citation": "@inproceedings{teinemaa2015procedurl,  title={A Procedural Approach for Infinite Deterministic 2D Grid-Based World Generation},  author={Tanel Teinemaa and Till Riemer and Noor Shaker},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Automatic Generation of Game-based CAPTCHAs",
      "year": 2015,
      "authors": "Hong Yu and Mark O. Riedl",
      "abstract": "A Completely Automated Public Turing test to tell Computers and Humans Apart (CAPTCHA) is a challenge-response test used on the Internet to prevent bots from accessing web services that are designed for humans. In this paper, we propose Automatic Game-based CAPTCHA Generation (AGCG), in which an AI system generates games that, when played, distinguish between humans and bots. The game-based CAPTCHA takes advantage of not only the bots’ difficulty in performing pattern/object recognition, but also their lack of commonsense knowledge. Thus it is more secure but remains easy and fun for humans, compared to traditional visual based CAPTCHAs. Furthermore, our AGCG system is capable of learning new commonsense knowledge based on users’ response in the game-based CAPTCHAs.",
      "keywords": "captcha, gamification, procedural content generation, commonsense knowledge",
      "citation": "@inproceedings{yu2015generation,  title={Automatic Generation of Game-based CAPTCHAs},  author={Hong Yu and Mark O. Riedl},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Data Adventures",
      "year": 2015,
      "authors": "Gabriella A. B. Barros, Antonios Liapis, and Julian Togelius",
      "abstract": "This paper outlines a system for generating adventure games based on open data, and describes a sketch of the system implementation at its current state. The adventure game genre has been popular for a long time and differs significantly in design priorities from game genres which are commonly addressed in PCG research. In order to create believable and engaging content, we use data from DBpedia to generate the game’s non-playable characters locations and plot, and OpenStreetMaps to create the game’s levels.",
      "keywords": "",
      "citation": "@inproceedings{barros2015adventures,  title={Data Adventures},  author={Gabriella A. B. Barros and Antonios Liapis and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Design Motifs: A Grammar Based Approach",
      "year": 2015,
      "authors": "Joseph Mazeika and Jim Whitehead",
      "abstract": "The notion of generating artifacts using a design motif has a long history in the tradition of generative systems, however no formal definition of design motif currently exists. We present a formal definition that unifies these previous approaches, while also proposing several novel systems that incorporate this definition, in a way that allows generators to switch the design motifs that they generate with.",
      "keywords": "design motif, procedural content generation, grammars",
      "citation": "@inproceedings{mazeika2015motifs,  title={Design Motifs: A Grammar Based Approach},  author={Joseph Mazeika and Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Generating Game Mechanics in a Model Economy: a MoneyMaker Deluxe Case Study",
      "year": 2015,
      "authors": "Stefan Leijnen, Paul Brinkkemper, and Anders Bouwer",
      "abstract": "This paper discusses the potential application of procedural content generation to a game about economical crises, intended to teach a large general audience about how banks function within a market-guided economy, and the financial risks and moral dilemmas that are involved. Procedurally generating content for abstract and complex notions such as inflation, market crashes, and market flux is different from generating spatial maps or physical assets in a game, and poses several design challenges. Instead of generating these kinds of phenomena and other macro-economic effects directly, the designers aim to let them emerge from automatically generated game mechanics. The game mechanics we propose include generic business models that can be parameterized to model the behavior of companies in the game, while the player controls the actions of a bank. What makes generating these game mechanics particularly challenging is the interaction between phenomena at different levels of abstraction. Therefore, relevant economic concepts are discussed in terms of design challenges, and how they could be modeled as emergent properties using generative methods.",
      "keywords": "",
      "citation": "@inproceedings{leijnen2015generating,  title={Generating Game Mechanics in a Model Economy: a MoneyMaker Deluxe Case Study},  author={Stefan Leijnen and Paul Brinkkemper and Anders Bouwer},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Generating Natural Language Retellings from Prom Week Play Traces",
      "year": 2015,
      "authors": "Christopher Antoun, Matthew Antoun, James Owen Ryan, Ben Samuel, Reid Swanson, and Marilyn A. Walker",
      "abstract": "Because they have massive state spaces, authorial burden is especially pronounced in games that are underpinned by rich simulations; as such, this class of games represents perhaps the strongest use case for procedural content generation. In this paper, we outline ongoing work in which we procedurally generate natural language retellings of playthroughs of the social-simulation game Prom Week. We do this by parsing play trace files to create semantic encodings, which are then passed to an existing surface realizer that produces the retellings. Herein, we provide illustration and discussion of our methods as well as an evaluation of the retellings. While our work here concerns a specific game, we envision far-reaching implications: if a game engine can produce natural language describing what has happened in the world, then content such as in-game journals, quest logs, histories, and even character dialogue may be generated automatically.",
      "keywords": "authorial burden, natural language generation, procedural content generation, story recognition",
      "citation": "@inproceedings{antoun2015generating,  title={Generating Natural Language Retellings from Prom Week Play Traces},  author={Christopher Antoun and Matthew Antoun and James Owen Ryan and Ben Samuel and Reid Swanson and Marilyn A. Walker},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Graph Grammars for Super Mario Bros* Levels",
      "year": 2015,
      "authors": "Santiago Londoño and Olana Missura",
      "abstract": "We assume that the structure of a level in a platformer game has a profound influence on the enjoyment of players. Another assumption is that, given levels created by expert designers, it is possible to extract and transfer their structural properties to new levels. To make it an automatic process, in this paper we first propose a graph-based representation of Super Mario Bros levels to encode their structure. Next, to abstract the structural elements we extend an algorithm for learning a graph grammar, SubdueGL, to produce a stochastic graph grammar. Then we describe our work in progress on generating new levels from graphs produced by the graph grammar.",
      "keywords": "stochastic graph grammars, graph data mining, game level generation, procedural content generation",
      "citation": "@inproceedings{londoño2015grammars,  title={Graph Grammars for Super Mario Bros* Levels},  author={Santiago Londoño and Olana Missura},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Procedural generation of populations for storytelling",
      "year": 2015,
      "authors": "Bas in het Veld, Ben Kybartas, Rafael Bidarra, and John-Jules Ch. Meyer",
      "abstract": "Procedural world generation is often limited to creating worlds devoid of people and any background. Because of this, creating a vibrant, living world is still a problem that requires a skilled designer. In this paper, we present a method that generates a socially connected population in any virtual terrain, using a mixed-initiative simulation of settlements that adapt to the world and to a designer’s input. Using this simulation, we develop a number of sample worlds that convey the expressive potential of the approach. We further evaluate ease of use with a user study. As a proof-of-concept, we implement the system to bridge the output of a terrain generation tool to the input of a narrative generation tool.",
      "keywords": "computational storytelling, population generation, procedural content generation",
      "citation": "@inproceedings{veld2015procedural,  title={Procedural generation of populations for storytelling},  author={Bas in het Veld and Ben Kybartas and Rafael Bidarra and John-Jules Ch. Meyer},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Teaching Japanese through Game Mechanics: An exploratory study",
      "year": 2015,
      "authors": "Cameron Olson, Daniel Kauffman, Allan Fowler, and Foaad Khosmood",
      "abstract": "The goal to design a game that is both educational and enjoyable can present some unique challenges. Using effective educational methods can sometimes conflict with good design strategies for creating an enjoyable game. Kanakatana is an exploration into using procedurally generated content in foreign language learning role-playing-games (RPG). It was designed so that its most important mechanics leverage similarities between learning a new language and playing an RPG. Through using specifically procedural content generation, the authors are able to create a game that detects the progress of the learner and automatically increase to more advanced levels based on prior performance. A 21-person user study shows that although less than 50% of the participants self-assess as having learned any Japanese by playing Kanakatana, their own post-game assessment performance suggests that 68-72% did in fact learn.",
      "keywords": "procedural content generation, japanese, learning",
      "citation": "@inproceedings{olson2015teaching,  title={Teaching Japanese through Game Mechanics: An exploratory study},  author={Cameron Olson and Daniel Kauffman and Allan Fowler and Foaad Khosmood},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Toward Game Level Generation from Gameplay Videos",
      "year": 2015,
      "authors": "Matthew Guzdial and Mark O. Riedl",
      "abstract": "Algorithms that generate computer game content require game design knowledge. We present an approach to automatically learn game design knowledge for level design from gameplay videos. We further demonstrate how the acquired design knowledge can be used to generate sections of game levels. Our approach involves parsing video of people playing a game to detect the appearance of patterns of sprites and utilizing machine learning to build a probabilistic model of sprite placement. We show how rich game design information can be automatically parsed from gameplay videos and represented as a set of generative probabilistic models. We use Super Mario Bros. as a proof of concept. We evaluate our approach on a measure of playability and stylistic similarity to the original levels as represented in the gameplay videos.",
      "keywords": "procedural content generation, probabilistic models, machine learning",
      "citation": "@inproceedings{guzdial2015toward,  title={Toward Game Level Generation from Gameplay Videos},  author={Matthew Guzdial and Mark O. Riedl},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2015}}"
    },
    {
      "title": "Automatically Categorizing Procedurally Generated Content for Collecting Games",
      "year": 2014,
      "authors": "Sebastian Risi, Joel Lehman, David B. D’Ambrosio, and Kenneth O. Stanley",
      "abstract": "A potentially promising application for procedural content generation (PCG) is collecting games, i.e. games in which the player strives to collect as many classes of possible artifacts as possible from a diverse set. However, the challenge for PCG in collecting games is that procedurally generated content on its own does not fall into a predefined set of classes, leaving no concrete quantifiable measure of progress for players to follow. The main idea in this paper is to remedy this shortcoming by feeding a sample of such content into a self-organizing map (SOM) that then in effect generates as many categories as there are nodes in the SOM. Once thereby organized, any new content discovered by a player can be categorized simply by identifying the node most activate after its presentation. This approach is tested in this paper in the Petalz video game, where 80 categories for user-bred flowers are generated by a SOM, allowing players to track their progress in discovering all the ”species” that are now explicitly identified. The hope is that this idea will inspire more researchers in PCG to investigate applications to collecting games in the future.",
      "keywords": "",
      "citation": "@inproceedings{risi2014automatically,  title={Automatically Categorizing Procedurally Generated Content for Collecting Games},  author={Sebastian Risi and Joel Lehman and David B. D’Ambrosio and Kenneth O. Stanley},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2014}}"
    },
    {
      "title": "Characteristics of Generatable Games",
      "year": 2014,
      "authors": "Julian Togelius, Mark J. Nelson, and Antonios Liapis",
      "abstract": "We address the problem of generating complete games, rather than content for existing games. In particular, we try to answer the question which types of games it would be realistic or even feasible to generate. To begin to answer the question, we first list the different ways we see that games could be generated, and then try to discuss what characterises games that would be comparatively easy or hard to generate. The discussion is structured according to a subset of the characteristics discussed in the book Characteristics of Games by Elias, Garfield and Gutschera.",
      "keywords": "",
      "citation": "@inproceedings{togelius2014characteristics,  title={Characteristics of Generatable Games},  author={Julian Togelius and Mark J. Nelson and Antonios Liapis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2014}}"
    },
    {
      "title": "Generating and Adapting Game Mechanics",
      "year": 2014,
      "authors": "Alexander Zook and Mark O. Riedl",
      "abstract": "Game designs often center on the game mechanics—rules governing the logical evolution of the game. We seek to develop an intelligent system that generates computer games and assists humans in designing games. As first steps towards this goal we present a composable and cross-domain representation for game mechanics that draws from AI planning action representations. We use a constraint solver to generate mechanics subject to design requirements on the form of those mechanics—what they do in the game. A planner takes a set of generated mechanics and tests whether those mechanics meet playability requirements—controlling how mechanics function in a game to affect player behavior. We demonstrate our system by modeling and generating mechanics in a role-playing game, platformer game, and combined role-playing-platformer game.",
      "keywords": "procedural content generation, game mechanics, game design",
      "citation": "@inproceedings{zook2014generating,  title={Generating and Adapting Game Mechanics},  author={Alexander Zook and Mark O. Riedl},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2014}}"
    },
    {
      "title": "Procedural Guard Placement for Stealth Games",
      "year": 2014,
      "authors": "Qihan Xu, Jonathan Tremblay, and Clark Verbrugge",
      "abstract": "Stealth game mechanics rely on a suitably difficult distribution of enemy observers, the placement of which is typically a manual process. Here we investigate an automatic process for placement of observer opponents. We use a Monte-Carlo approach to generate randomized enemy positions and mo- tions and combine this with a stealth path-planning and analysis framework. This allows us to ensure feasibility of the level design, and also measure relative difficulty. Initial results using this process compare placement of both mobile and static guards (rotating cameras), and let us explore the impact on level difficulty produced by different kinds of enemy observer agents.",
      "keywords": "computer games, stealth, procedural generation",
      "citation": "@inproceedings{xu2014procedural,  title={Procedural Guard Placement for Stealth Games},  author={Qihan Xu and Jonathan Tremblay and Clark Verbrugge},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2014}}"
    },
    {
      "title": "Towards Challenge Balancing for Personalised Game Spaces",
      "year": 2014,
      "authors": "Sander Bakkes and Shimon Whiteson",
      "abstract": "This article focuses on games that can tailor the pro- vided game experience to the individual player (personalised games), typically by effectively utilising player models. A particular challenge in this regard, is utilising player models for assessing online (i.e., while the game is being played) and unobtrusively which game adaptations are appropriate. In this article, we propose an approach for personalising the space in which a game is played (i.e., levels) – to the end of tailoring the experienced challenge to the individual player during actual play of the game. Our approach specifically considers two persisting design challenges, namely implicit user feedback and high risk of user abandonment. Our contribution to this end is proposing a clear separation between (intelligent) offline exploration and (safety-conscious) online exploitation. We are presently assessing the effectiveness of the developed approach in an actual video game: Infinite Mario Bros. [18]. To this end, we have enhanced the game such that its process for procedural-content generation allows the game spaces (i.e., levels) to be personalised during play of the game. We use data from intelligent offline exploration to determine both a model of experienced challenge as well as safe level design parameters for use on new players. Online, we use a gradient ascent algorithm with designer-specified domain knowledge to select the next set of level design parameters.",
      "keywords": "personalisation, game spaces, challenge balancing, video games, implicit user feedback, user abandonment",
      "citation": "@inproceedings{bakkes2014challenge,  title={Towards Challenge Balancing for Personalised Game Spaces},  author={Sander Bakkes and Shimon Whiteson},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2014}}"
    },
    {
      "title": "Combinatorial and Exploratory Creativity in Procedural Content Generation",
      "year": 2013,
      "authors": "Joris Dormans and Stefan Leijnen",
      "abstract": "Procedural content generation aims to algorithmically produce creative solutions to game design challenges. This paper investigates how computational creativity theory can be applied to improve current PCG tools and techniques. It suggests that content generation may be considered as a dual process: a generation step to create variety and a resolution step to transform the output of the generation into a coherent and useful configuration. Separating these two steps facilitates the design of PCG algorithms and impacts the design of PCG tools.",
      "keywords": "",
      "citation": "@inproceedings{dormans2013combinatorial,  title={Combinatorial and Exploratory Creativity in Procedural Content Generation},  author={Joris Dormans and Stefan Leijnen},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2013}}"
    },
    {
      "title": "Data Games",
      "year": 2013,
      "authors": "Marie Gustafsson Friberger, Julian Togelius, Andrew Borg Cardona, Michele Ermacora, Anders Mousten, Martin Møller Jensen, Virgil-Alexandu Tanase, and Ulrik Brøndsted",
      "abstract": "We define data games as games where gameplay and/or game content is based on real-world data external to the game, and where gameplay supports the exploration of and learning from this data. This concept is discussed in relation to open data, procedural content generation and serious games, and research challenges are outlined. To illustrate the concept, we present six prototype games and content generators of our own making. We also present a tentative taxonomy of actual and potential data games, and situate the described games within this taxonomy.",
      "keywords": "",
      "citation": "@inproceedings{friberger2013games,  title={Data Games},  author={Marie Gustafsson Friberger and Julian Togelius and Andrew Borg Cardona and Michele Ermacora and Anders Mousten and Martin Møller Jensen and Virgil-Alexandu Tanase and Ulrik Brøndsted},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2013}}"
    },
    {
      "title": "Generative Methods",
      "year": 2013,
      "authors": "Kate Compton, Joseph C. Osborn, and Michael Mateas",
      "abstract": "The field of procedural content generation continues to grow in scope and in technology, but the term “procedural content generation” awkwardly suggests that the field’s output be defined by its ability to produce game “content”, a term that fails to capture the breadth of artifacts produced by PCG researchers. There are many parallel fields of research on using algorithmic means to generate what we often call “content”, but due to differences in terminology and industry they have remained invisible to the mainstream of games research. In this paper, we propose the term “generative methods” to refer to all such generative systems. This term relates our practice to similar work in generative art, generative music, generative design, and other fields, and reconnects game artifact generation problems to their historical (but non-game-specific) instances that have often been overlooked.",
      "keywords": "procedural content generation, generative methods, parametric",
      "citation": "@inproceedings{compton2013generative,  title={Generative Methods},  author={Kate Compton and Joseph C. Osborn and Michael Mateas},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2013}}"
    },
    {
      "title": "Mobile adaptive procedural content generation",
      "year": 2013,
      "authors": "Ricardo Lopes, Ken Hilf, Luke Jayapalan, and Rafael Bidarra",
      "abstract": "The nature of most modern mobile games is different from that of most computer/console games, which are typically targeted at casual gamers and are played in a wide variety of space, time and device contexts. We argue that this feature of mobile games naturally fits with adaptive procedural content generation (PCG). In this paper, we propose the integration of two PCG-based approaches (experience-driven and context-driven PCG) to support the generation of adaptive mobile game levels. We present and discuss the implementation of our approach in an existing game, 7’s Wild Ride. Gameplay semantics and player modeling are used to steer a level generator, featuring a time-dependent dynamic difficulty adjustment mechanism. From our two user studies, we conclude that (i) context-driven levels are preferable over traditional ones, and (ii) the game can adapt to different player types, keeping its gameplay balanced and player satisfaction.",
      "keywords": "adaptive games, procedural content generation, semantics",
      "citation": "@inproceedings{lopes2013adaptive,  title={Mobile adaptive procedural content generation},  author={Ricardo Lopes and Ken Hilf and Luke Jayapalan and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2013}}"
    },
    {
      "title": "Node-Based Shape Grammar Representation and Editing",
      "year": 2013,
      "authors": "Pedro Brandão Silva, Pascal Müller, Rafael Bidarra, and António Coelho",
      "abstract": "Mass content creation is nowadays one of the most important challenges for game artists. This paper presents a high-level architectural modeling solution that combines the full generative power of shape grammars with the ease of use and flexibility of a node-based visual language. Our approach comprises a shape data flow character and introduces some novel features, including recursion, parametric flow, and flow filtering. The main development model consists of encapsulating basic operations into semantically-rich, reusable components that can be more easily assembled using filters. Eventually, this enables users to concentrate on the more intuitive and interactive development layers, while the text-based grammar rules are automatically generated.",
      "keywords": "shape grammars, node-based design, semantics",
      "citation": "@inproceedings{silva2013nodebased,  title={Node-Based Shape Grammar Representation and Editing},  author={Pedro Brandão Silva and Pascal Müller and Rafael Bidarra and António Coelho},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2013}}"
    },
    {
      "title": "Procedural Terrain Generation for Medical Rehabilitation",
      "year": 2013,
      "authors": "Michael Andereck, Alan Price, and Roger Crawfis",
      "abstract": "Virtual terrain generation has been a popular area of research over the last thirty years. More recently the topic of using video games to promote exercise and rehabilitation has gained momentum. We propose a system which allows for physical therapists to aid in the creation and management of virtual environments for use in conjunction with walking and balance exercises. Our system allows the therapist to design a 3D path with challenges including hills and turns suitable for the ability of the patient. After the path has been designed, the system generates a terrain using an iterative surface-matching quadtree algorithm, culminating in an immersive, engaging environment for the patient.",
      "keywords": "procedural terrain generation; user-defined paths; immersive environments; video games",
      "citation": "@inproceedings{andereck2013procedural,  title={Procedural Terrain Generation for Medical Rehabilitation},  author={Michael Andereck and Alan Price and Roger Crawfis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2013}}"
    },
    {
      "title": "Team Blockhead Wars: Generating FPS Weapons in a Multiplayer Environment",
      "year": 2013,
      "authors": "Eric McDuffee and Alex Pantaleev",
      "abstract": "We present an attempt at exploring the search space of weapons in team-based multiplayer First-Person Shooters (FPS). At the foundation of the experiment is Team Blockhead Wars (TBHW), a game that we developed for the purposes of this project. TBHW allows human players to enjoy classic multiplayer FPS gameplay and uses a genetic algorithm to continuously generate new weapons. A weapon’s genome consists of ten real-valued parameters, which together form a vast search space that includes common FPS weapon tropes. The evaluation function scores weapons on the basis of their use by players. The game also generates 3D meshes to visually represent the generated weapons for easy player recognition. While TBHW is work in progress, preliminary results are encouraging.",
      "keywords": "games, procedural content generation, game design, first-person shooters",
      "citation": "@inproceedings{mcduffee2013blockhead,  title={Team Blockhead Wars: Generating FPS Weapons in a Multiplayer Environment},  author={Eric McDuffee and Alex Pantaleev},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2013}}"
    },
    {
      "title": "Anza Island: Novel Gameplay Using ASP",
      "year": 2012,
      "authors": "Kate Compton, Adam Smith, and Michael Mateas",
      "abstract": "Procedural content generation (PCG) has the potential to create unique artifacts, levels, and gameplay mechanics. However, it remains challenging to generate content that satisfies gameplay constraints: methods to achieve this include generate-and-test, search-based generation, and constructive methods. In this paper, we present a prototype, a simple game, which demonstrates the use of an off-the-shelf logic program solver, Clingo, as an easy and expressive way to model these constraint problems, and find solutions that satisfy gameplay constraints. By delegating the difficult search optimization problem to an external program, we were able to quickly prototype PCG in a low-effort way by expressing the desired content as a set of rules and constraints, keeping the focus on the designer’s intentions for the generated content, rather than specific methods used to create or find it. The expressiveness and versatility of this approach is demonstrated by applying this technique to two areas of PCG in the game.",
      "keywords": "procedural content generation, answer set programming, puzzle games",
      "citation": "@inproceedings{compton2012island,  title={Anza Island: Novel Gameplay Using ASP},  author={Kate Compton and Adam Smith and Michael Mateas},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Compositional procedural content generation",
      "year": 2012,
      "authors": "Julian Togelius, Tróndur Justinussen, and Anders Hartzen",
      "abstract": "We consider the strengths and drawbacks of various procedural content generation methods, and how they could be combined to hybrid methods that retain the advantages and avoid the disadvantages of their constituent methods. One answer is composition, where one method is nestled inside another. As an example, we present a hybrid evolutionary-ASP dungeon generator.",
      "keywords": "",
      "citation": "@inproceedings{togelius2012compositional,  title={Compositional procedural content generation},  author={Julian Togelius and Tróndur Justinussen and Anders Hartzen},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Designing Semantic Game Worlds",
      "year": 2012,
      "authors": "Jassin Kessing, Tim Tutenel, and Rafael Bidarra",
      "abstract": "Current game worlds often fall short in providing consistency between the visual representation of the world and the way it feels, behaves, and reacts. This problem partly originates from the goal-oriented and cost-effective nature of the game development process, which mostly favors ad hoc solutions for one particular game, rather than investing in concepts like reusability and emergent gameplay. In broader terms, we observe that game worlds miss semantics, and we argue that its deployment has the potential to bring about the consistency missing in their content. Therefore, wepresent a novel approach aimed at enriching virtual entities in game worlds with information about their roles, how they relate to others, and how they can affect and interact with players, NPCs, and with each other. We discuss several requirements to achieve these goals, and introduce a semantic model to represent game worlds. In order to support and validate this model, we have developed Entika, a framework to facilitate the deployment of semantics during game development, as well as its maintenance during run-time. Furthermore, we briefly discuss several applications that demonstrate the power of this semantic model for game worlds. After careful evaluation of our semantic game world model and framework, we conclude that a semantically rich world representation can substantially assist designers in creating much more consistent game worlds.",
      "keywords": "game worlds, semantics, object interaction",
      "citation": "@inproceedings{kessing2012designing,  title={Designing Semantic Game Worlds},  author={Jassin Kessing and Tim Tutenel and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Fast exact graph matching using adjacency matrices",
      "year": 2012,
      "authors": "Marlon Etheredge",
      "abstract": "This paper introduces a technique of graph subgraph searching, that allows for varied complex subgraphs to be matched in directed or undirected target graphs in a fast and flexible manner. Along with a discussion on the contrast with other known algorithms, benchmarks are presented that compare these known algorithms to the algorithm that is presented in this paper.",
      "keywords": "graph grammars, graph subsets, graph rewrite rules, procedural generation",
      "citation": "@inproceedings{etheredge2012exact,  title={Fast exact graph matching using adjacency matrices},  author={Marlon Etheredge},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Game-O-Matic: Generating Videogames that Represent Ideas",
      "year": 2012,
      "authors": "Mike Treanor, Bryan Blackford, Michael Mateas, and Ian Bogost",
      "abstract": "In this paper, we describe Game-O-Matic, a videogame authoring tool and generator that creates games that represent ideas. Through using a simple concept map input system, networks of nouns connected by verbs, Game-O-Matic is able to assemble simple arcade style game mechanics into videogames that represent the ideas represented in the concept map. Inspired by a view that videogames convey messages through their mechanics, Game-O-Matic makes use of the rhetorical affordances of explicitly defined abstract gameplay patterns, which we call micro-rhetorics. This paper explains how Game-O-Matic uses the concept map input to select appropriate abstract patterns of gameplay and then how these mash ups of patterns are shaped into coherent playable games that can be said to represent the user’s intent.",
      "keywords": "procedural content generation, game generation, game design, procedural rhetoric",
      "citation": "@inproceedings{treanor2012gameomatic,  title={Game-O-Matic: Generating Videogames that Represent Ideas},  author={Mike Treanor and Bryan Blackford and Michael Mateas and Ian Bogost},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Generating Emergent Physics for Action-Adventure Games",
      "year": 2012,
      "authors": "Joris Dormans",
      "abstract": "Action-adventure games typically integrate levels, progression with the physical gameplay. In order to generate content for this type of games, this paper explores how procedural techniques can be expanded to beyond the domain of generating levels, and into generating physical interactions. It suggests a formal graph language to represent physics and the network of causal relations between game entities. Leveraging transformational grammars, the principles of model driven architecture, and component-based architecture for the game engine, it is argued that physics diagrams are well suited to generate emergent physical gameplay.",
      "keywords": "",
      "citation": "@inproceedings{dormans2012generating,  title={Generating Emergent Physics for Action-Adventure Games},  author={Joris Dormans},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Generating Responsive Life-Like Biped Characters",
      "year": 2012,
      "authors": "Ben Kenwright",
      "abstract": "In this paper, we present a real-time method for generating 3D biped character motions that are dynamic and responsive but also believably life-like and natural. Our model uses a physics-based controller to generate intelligent foot placement and upper-body postural information, that we combine with random human-like movements and an inverse kinematic solver to generate realistic character animations. The key idea is modulating procedurally random rhythmic motions seamlessly in with a physics-based model to produce less robot-like static looking characters and more life-like dynamic ones. Moreover, our method is straightforward, computationally fast and produces remarkably expressive motions that are physically accurate while being interactive.",
      "keywords": "natural, responsive, 3d, character, balancing, physics-based, games, non-repetitive, real-time, procedural animation",
      "citation": "@inproceedings{kenwright2012generating,  title={Generating Responsive Life-Like Biped Characters},  author={Ben Kenwright},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "In Search of Patterns: Disrupting RPG Classes through Procedural Content Generation",
      "year": 2012,
      "authors": "Alex Pantaleev",
      "abstract": "This paper presents a first attempt at exploring the search space of Role-Playing Game (RPG) skill systems, with the hope to find stable patterns outside of conventional RPG classes. At the foundation of the experiment is a small text-based game that allows human players to enter RPG combat and uses an evolutionary algorithm to generate and suggest new character abilities to them. The content representation was carefully chosen to be simultaneously simple and expressive. The evaluation function scores abilities based on their use by players. While the game is far from finished, preliminary test results are encouraging.",
      "keywords": "games, procedural content generation, game design, role-playing games",
      "citation": "@inproceedings{pantaleev2012search,  title={In Search of Patterns: Disrupting RPG Classes through Procedural Content Generation},  author={Alex Pantaleev},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Modeling Urban Environments from Geospatial Data: A Pipeline for Procedural Modeling",
      "year": 2012,
      "authors": "Diego Jesus, Antonio Coelho, Carlos Rebelo, and Andre Cardoso",
      "abstract": "In game development there is often the need to generate realistic urban environments, i.e. 3D virtual environments that replicate existing urban areas. However, modeling such spaces using traditional techniques is both too slow and too expensive. A good solution is the use of procedural modeling techniques to automate the process. However these techniques require large amounts of geospatial data, which are usually stored in Geographic Information Systems (GIS). This paper presents a pipeline for the integration of both geometric and semantic data from GIS data sources into procedural modeling techniques used for the generation of 3D virtual urban environments. GIS data can already be used in procedural modeling tools but these do not provide an easy and uniform way to incorporate semantic information from different data sources. To solve this problem, the proposed pipeline is capable of transforming semantic and geometric information from different sources into 3D environments that replicate specific urban areas.",
      "keywords": "procedural modeling, gis, virtual urban environments",
      "citation": "@inproceedings{jesus2012modeling,  title={Modeling Urban Environments from Geospatial Data: A Pipeline for Procedural Modeling},  author={Diego Jesus and Antonio Coelho and Carlos Rebelo and Andre Cardoso},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Procedural Generation of Narrative Puzzles in Adventure Games: The Puzzle-Dice System",
      "year": 2012,
      "authors": "Clara Fernández-Vara and Alec Thomson",
      "abstract": "This project tackles procedural generation of narrative puzzles found in adventure games. The challenge is not only generating the puzzles in games which traditionally only have one walkthrough, but also making the development process accessible to designers. Given that the goal is to make these games playable and easy to develop, the focus of this project is facilitating the immediate development of these games. This paper describes the system of procedural generation of one game, Symon, which was the reference and inspiration for a standalone toolset, the Puzzle Dice System to create other adventure games with procedurally generated puzzles. The toolset has been put to the test with another game, Stranded in Singapore, and it is still being expanded and improved on at the moment of writing.",
      "keywords": "procedural generation, adventure games, puzzles, narrative",
      "citation": "@inproceedings{fernández-vara2012procedural,  title={Procedural Generation of Narrative Puzzles in Adventure Games: The Puzzle-Dice System},  author={Clara Fernández-Vara and Alec Thomson},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Sharing Authoring with Algorithms: Procedural Generation of Satellite Sentences in Text-based Interactive Stories",
      "year": 2012,
      "authors": "Aaron A. Reed",
      "abstract": "As both a fiction writer and a computer scientist, I want the interactive stories I create to be meaningfully interactive: choices should matter. To avoid laborious hand-authoring of variations, procedural content generation (PCG) seems appealing; but PCG has been less successful in producing compelling narrative text than in other realms. To address this problem, I consider the minimum amount of PCG that might make a human-authored story computationally interesting but still authorially sound. The resulting research prototype generates “satellite” sentences (which moderate pacing and reestablish context within dialogue scenes) within otherwise hand-authored scenes in a complete interactive story.",
      "keywords": "",
      "citation": "@inproceedings{reed2012authoring,  title={Sharing Authoring with Algorithms: Procedural Generation of Satellite Sentences in Text-based Interactive Stories},  author={Aaron A. Reed},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Skill-based Mission Generation: A Data-driven Temporal Player Modeling Approach",
      "year": 2012,
      "authors": "Alexander Zook, Stephen Lee-Urban, Michael R. Drinkwater, and Mark O. Riedl",
      "abstract": "Games often interweave a story and series of skill-based events into a complete sequence—a mission. An automated mission generator for skill-based games is one way to synthesize designer requirements with player differences to create missions tailored to each player. We argue for the need for predictive, data-driven player models that meet the requirements of: (1) predictive power, (2) accounting for temporal changes in player abilities, (3) accuracy in the face of little or missing player data, (4) efficiency with large sets of data, and (5) sufficiency for algorithmic generation. We present a tensor factorization approach to modeling and predicting player performance on skill-based tasks that meets the above requirements and a combinatorial optimization approach to mission generation to interweave an author’s preferred story structures and an author’s preferred player performance over a mission—a kind of difficulty curve—with modeled player performance.",
      "keywords": "procedural content generation, optimization, player modeling",
      "citation": "@inproceedings{zook2012skillbased,  title={Skill-based Mission Generation: A Data-driven Temporal Player Modeling Approach},  author={Alexander Zook and Stephen Lee-Urban and Michael R. Drinkwater and Mark O. Riedl},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "Using gameplay semantics to procedurally generate player-matching game worlds",
      "year": 2012,
      "authors": "Ricardo Lopes, Tim Tutenel, and Rafael Bidarra",
      "abstract": "The use of procedural content generation to support adaptive games is starting to gain momentum in current research. However, there are still many open issues to tackle, namely the reusability of methodologies. Our research focuses on reusable and generic methods for linking the procedural generation of 3D game worlds with gameplay, as measured by player modelling techniques. As the interface for that link, we propose the use of gameplay semantics, a knowledge representation technique that allows our case-based generator to match content to player models. We present and discuss the implementation of our proposed method in an existing game, Stunt Playground. Gameplay semantics is created by designers in a generic way and is then used to procedurally generate player-matching Stunt Playground gameworlds, both atthedesignandgamestage. Current results show that our approach can automatically create such adaptive game content, thus effectively bridging game world designers, procedural generation and gameplay.",
      "keywords": "adaptive game worlds, procedural content generation, semantics",
      "citation": "@inproceedings{lopes2012gameplay,  title={Using gameplay semantics to procedurally generate player-matching game worlds},  author={Ricardo Lopes and Tim Tutenel and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2012}}"
    },
    {
      "title": "A Prototype Quest Generator Based on a Structural Analysis of Quests from Four MMORPGs",
      "year": 2011,
      "authors": "Jonathon Doran and Ian Parberry",
      "abstract": "An analysis of over 750 quests from four popular RPGs (Eve Online, World of Warcraft, Everquest, and Vanguard: Saga of Heroes) reveals that RPG quests appear to share a common structure. We propose a classification of RPG quests based on this structure, and describe a prototype quest generator based on that classification. Our aim is to procedurally generate quests that are complex, multi-leveled, and plausible to players of RPGs. We analyze a nontrivial quest from Everquest and one from our prototype quest generator for comparison.",
      "keywords": "quest, role-playing game, rpg, mmorpg, npc, procedural content generation, planning, intractability, java, prolog, bnf",
      "citation": "@inproceedings{doran2011prototype,  title={A Prototype Quest Generator Based on a Structural Analysis of Quests from Four MMORPGs},  author={Jonathon Doran and Ian Parberry},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "Lessons in User Interface Design in the Procedural City Generation for Games Tool Ürban PAD",
      "year": 2011,
      "authors": "Lionel Barret, Claudia Vance, and G. Michael Youngblood",
      "abstract": "Procedural content generation design often involves configuring an array of abstract choices at each stage of the creation process. For new tools users, or for a non-specialist user, these choices are often complex and uncertain. A good interface that guides the user in their choices helps overcome this uncertainty and subsequent frustration with the process of generating procedural content. Since good user interface (UI) experiences facilitate adoption, procedural software tool developers constantly refine UI design in order to accommodate the engineering demands of procedural content generation architecture and translate them into a coherent user experience. This paper discusses Gamr7's experience in creating, testing, and refining procedural user interfaces based on our experience with redesigning the user interface for our procedural content generation software, ¨ Urban PAD. This case study will address user expectations, architecture, and execution flow considerations as well as solutions to some of Ürban PAD's specific user interface challenges.",
      "keywords": "procedural city generation, user interface, lessons learned",
      "citation": "@inproceedings{barret2011lessons,  title={Lessons in User Interface Design in the Procedural City Generation for Games Tool Ürban PAD},  author={Lionel Barret and Claudia Vance and G. Michael Youngblood},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "Level Design as Model Transformation: A Strategy for Automated Content Generation",
      "year": 2011,
      "authors": "Joris Dormans",
      "abstract": "This paper frames the process of designing a level in a game as a series of model transformations. The transformations correspond to the application of particular design principles, such as the use of locks and keys to transform a linear mis- sion into a branching space. It shows that by using rewrite systems, these transformations can be formalized and automated. The resulting automated process is highly controllable: it is a perfect match for a mixed-initiative approach to level generation where human and computer collaborate in designing levels. An experimental prototype that implements these ideas is presented.",
      "keywords": "",
      "citation": "@inproceedings{dormans2011design,  title={Level Design as Model Transformation: A Strategy for Automated Content Generation},  author={Joris Dormans},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "PCG-based game design: enabling new play experiences through procedural content generation",
      "year": 2011,
      "authors": "Gillian Smith, Elaine Gan, Alexei Othenin-Girard, and Jim Whitehead",
      "abstract": "This paper discusses the concept of procedural content generation-based (PCG-based) game design as a way to create new kinds of playable experiences. We examine the different ways that PCG is currently used in games, and how that use impacts the meaning of the game and the player's experience. Finally, we discuss the design and implementation of an experimental PCG-based 2D platformer called Rathenn, which provides the player with control over the level they are playing while they explore both the physical and generative spaces of the game.",
      "keywords": "procedural level generation, game design, game design theory",
      "citation": "@inproceedings{smith2011pcgbased,  title={PCG-based game design: enabling new play experiences through procedural content generation},  author={Gillian Smith and Elaine Gan and Alexei Othenin-Girard and Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "Procedural filters for customization of virtual worlds",
      "year": 2011,
      "authors": "Tim Tutenel, Roland van der Linden, Marnix Kraus, Bart Bollen, and Rafael Bidarra",
      "abstract": "Designing virtual game worlds is often a long and labor-intensive process. Moreover, when a game world needs to be slightly altered in appearance, the entire process needs to be repeated, or will at least require some repetitious tasks. Ideally, when the same game world is needed under different circumstances (e.g. in another season, before and after a war, in prosperous or poor economic conditions), the designer should be aided in this process using procedural generation techniques. We propose an approach for the specification of procedural filters that describe how (parts of) virtual worlds should be customized to fit a particular situation based on their semantics and the conditions of the situation. This description will guide the customization process by triggering and parametrizing, among others, procedural instructions that can change the appearance of the virtual world. We will discuss how the generic nature of this approach, which favors reusability, and its integration with semantics, which increases the intuitiveness of the design process, can eliminate many of the repetitious tasks involved in performing these actions manually. We describe an implementation of this approach that shows how some simple procedural filters can i) age an urban environment and simulate the effects of poor living conditions on the look of that environment, and ii) apply a party atmosphere to an ordinary office scene.",
      "keywords": "procedural filters; procedural content generation; virtual worlds; semantics",
      "citation": "@inproceedings{tutenel2011procedural,  title={Procedural filters for customization of virtual worlds},  author={Tim Tutenel and Roland van der Linden and Marnix Kraus and Bart Bollen and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "Semantic constraints for procedural generation of virtual worlds",
      "year": 2011,
      "authors": "Ruben Smelik, Krzysztof Galka, Klaas Jan de Kraker, Frido Kuijper, and Rafael Bidarra",
      "abstract": "Procedural generation of virtual worlds is a promising alternative to classical manual modelling approaches, which usually require a large amount of effort and expertise. However, it suffers from a number of issues; most importantly, the lack of user control over the generation process and its outcome. Because of this, the result of a procedural method is highly unpredictable, rendering it almost unusable for virtual world designers. This paper focuses on providing user control to deliver an outcome consistent with designer’s intent. For this, we introduce semantic constraints, a flexible concept to express high-level designer’s intent in intuitive terms as e.g. line of sight. Our constraint evaluation method is capable of detecting the context in which such a constraint is specified, automatically adapting to surrounding features of the virtual world. From experiments performed within our prototype modelling system, we can conclude that semantic constraints are another step forward in making procedural generation of virtual worlds more controllable and accessible to non-specialist designers.",
      "keywords": "",
      "citation": "@inproceedings{smelik2011constraints,  title={Semantic constraints for procedural generation of virtual worlds},  author={Ruben Smelik and Krzysztof Galka and Klaas Jan de Kraker and Frido Kuijper and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "SpeedRock: procedural rocks through grammars and evolution",
      "year": 2011,
      "authors": "Isaac M. Dart, Gabriele De Rossi, and Julian Togelius",
      "abstract": "We present an approach to procedurally generating diverse and believable rocks for usage in games and virtual worlds. The basic idea is to evolve rulesets for three-dimensional L-systems. The fitness calculation involves expanding these rulesets a number of times, collapsing the resulting structure and evaluating how well the collapsed structure conforms to a user-specified shape. Texture is then applied through raycasting from a sphere around the evolved “skeleton”. The result is a lightweight, stand-alone tool for rock generation capable of exporting assets to mainstream modelling programs.",
      "keywords": "",
      "citation": "@inproceedings{dart2011speedrock,  title={SpeedRock: procedural rocks through grammars and evolution},  author={Isaac M. Dart and Gabriele De Rossi and Julian Togelius},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "Two methods for voxel detail enhancement",
      "year": 2011,
      "authors": "Adam M. Smith",
      "abstract": "In this paper I describe a novel technique called voxel detail enhancement that, inspired by pixel art scaling algorithms for 2D images, produces finely detailed (3D) voxel maps from the coarser maps that would be edited by a player's actions during gameplay. I describe two methods which deterministically generate fine voxel fragments that depend only on the occupancy of a local window of coarse voxels. Enhanced voxel maps can provide attractive visuals for voxel-based games without requiring the player to manipulate the world at a finer scale. Decoupling the geometry used in graphics and physics from the construction and destruction mechanics of the game opens up new gameplay possibilities in the design space occupied by games like Minecraft and Voxelstein 3D.",
      "keywords": "games, procedural content generation, voxels, pixel art",
      "citation": "@inproceedings{smith2011methods,  title={Two methods for voxel detail enhancement},  author={Adam M. Smith},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "What is Procedural Content Generation? Mario on the borderline",
      "year": 2011,
      "authors": "Julian Togelius, Emil Kastbjerg, David Schedl, and Georgios N. Yannakakis",
      "abstract": "We try to clarify the concept of procedural content generation (PCG) through contrasting it to other forms of content generation in games with which it could easily be mistaken, and through discussing some properties of PCG which are sometimes thought of as necessary but are actually not. After drawing up some clear demarcations for what is and what is not PCG, we present two versions of a content generation system for Infinite Mario Bros which is intentionally designed to question these same demarcations. We argue that, according to our own definition, one version of the system is an example of PCG while the other is not, even though they are mostly identical. We hope that this paper answers some questions but raises others, and inspires researchers and developers to thread some less common ground in developing content generation techniques.",
      "keywords": "",
      "citation": "@inproceedings{togelius2011what,  title={What is Procedural Content Generation? Mario on the borderline},  author={Julian Togelius and Emil Kastbjerg and David Schedl and Georgios N. Yannakakis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2011}}"
    },
    {
      "title": "Adventures in Level Design: Generating Missions and Spaces for Action Adventure Games",
      "year": 2010,
      "authors": "Joris Dormans",
      "abstract": "This paper investigates strategies to generate levels for action adventure games. This genre relies more strongly on well-designed levels than rule-driven genres such as strategy or roleplaying games for which procedural level generation has been successful in the past. The approach outlined by this paper distinguishes between missions and spaces as two separate structures that need to be generated in two individual steps. It discusses the merits of different types of generative grammars for each individual step in the process.",
      "keywords": "procedural generation; level design; action adventure games.",
      "citation": "@inproceedings{dormans2010adventures,  title={Adventures in Level Design: Generating Missions and Spaces for Action Adventure Games },  author={Joris Dormans },  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Analyzing the Expressive Range of a Level Generator",
      "year": 2010,
      "authors": "Gillian Smith and Jim Whitehead",
      "abstract": "This paper explores a method for analyzing the expressive range of a procedural level generator, and applies this method to Launchpad, a level generator for 2D platformers. Instead of focusing on the number of levels that can be created or the amount of time it takes to create them, we instead examine the variety of generated levels and the impact of changing input parameters. With the rise in the popularity of PCG, it is important to be able to fairly evaluate and compare different generation techniques within similar domains. We have found that such analysis can also expose unexpected biases in the generation algorithm and holes in the expressive range that drive future work.",
      "keywords": "procedural level generation, expressive range, evaluation methods",
      "citation": "@inproceedings{smith2010analyzing,  title={Analyzing the Expressive Range of a Level Generator},  author={Gillian Smith and Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Cellular automata for real-time generation of inﬁnite cave levels",
      "year": 2010,
      "authors": "Lawrence Johnson, Julian Togelius, and Georgios N. Yannakakis",
      "abstract": "This paper presents a reliable and efficient approach to procedurally generating level maps based on the self-organization capabilities of cellular automata (CA). A simple CA-based algorithm is evaluated on an infinite cave game, generating playable and well-designed tunnel-based maps. The algorithm has very low computational cost, permitting realtime content generation, and the proposed map representation provides sufficient ﬂexibility with respect to level design.",
      "keywords": "",
      "citation": "@inproceedings{johnson2010cellular,  title={Cellular automata for real-time generation of inﬁnite cave levels},  author={Lawrence Johnson and Julian Togelius and Georgios N. Yannakakis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Integrating procedural generation and manual editing of virtual worlds",
      "year": 2010,
      "authors": "Ruben Smelik, Tim Tutenel, Klaas Jan de Kraker, and Rafael Bidarra",
      "abstract": "Because of the increasing detail and size of virtual worlds, designers are more and more urged to consider employing procedural methods to alleviate part of their modeling work. However, such methods are often unintuitive to use, difficult to integrate, and provide little user control, making their application far from straightforward. In our declarative modeling approach, designers are provided with a more productive and simplified virtual world modeling workflow that matches better with their iterative way of working. Using interactive procedural sketching, they can quickly layout a virtual world, while having proper user control at the level of large terrain features. However, in practice, designers require a finer level of control. Integrating procedural techniques with manual editing in an iterative modeling workflow is an important topic that has remained relatively unaddressed until now. This paper identifies challenges of this integration and discusses approaches to combine these methods in such a way that designers can freely mix them, while the virtual world model is kept consistent during all modifications. We conclude that overcoming the challenges mentioned, for ex- ample in a declarative modeling context, is instrumental to achieve the much desired adoption of procedural modeling in mainstream virtual world modeling.",
      "keywords": "virtual worlds; declarative modeling; procedural methods; manual modelling",
      "citation": "@inproceedings{smelik2010integrating,  title={Integrating procedural generation and manual editing of virtual worlds},  author={Ruben Smelik and Tim Tutenel and Klaas Jan de Kraker and Rafael Bidarra},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Interactive Genetic Engineering of Evolved Video Game Content",
      "year": 2010,
      "authors": "Erin J. Hastings and Kenneth O. Stanley",
      "abstract": "Procedural content generation techniques can increase replayability and lower the burden on developers by satisfying players' demand for new content. However, procedural content also creates an opportunity for new kinds of player-driven content customization by giving players access to the parameterized content space. This paper presents such a technique that enables players to manually customize evolved content represented by artificial neural networks. In particular, particle system weapons evolved by the multiplayer space shooter called Galactic Arms Race (GAR) can be further \"genetically engineered\" by the players themselves in a new extension to the game called the Weapons Lab. Results are presented that demonstrate procedural weapons evolved by the game that are further customized by players in the Weapons Lab. The implication is that procedurally generated content of many types can also be customized by players, adding a further dimension to its potential appeal.",
      "keywords": "procedural content, galactic arms race, gar, content-generating neuroevolution of augmenting topologies, cgneat",
      "citation": "@inproceedings{hastings2010interactive,  title={Interactive Genetic Engineering of Evolved Video Game Content},  author={Erin J. Hastings and Kenneth O. Stanley},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Polymorph: Dynamic Difficulty Adjustment Through Level Generation",
      "year": 2010,
      "authors": "Martin Jennings-Teats, Gillian Smith, and Noah Wardrip-Fruin",
      "abstract": "Players begin games at different skill levels and develop their skill at different rates so that even the best-designed games are uninterestingly easy for some players and frustratingly difficult for others. A proposed answer to this challenge is Dynamic Difficulty Adjustment (DDA), a general category of approaches that alter games during play, in response to player performance. However, nearly all these techniques are focused on basic parameter tweaking, while the difficulty of many games is connected to aspects that are more challenging to adjust dynamically, such as level design. Further, most DDA techniques are based on designer intuition, which may not reflect actual play patterns. Responding to these challenges, we present Polymorph, which employs techniques from level generation and machine learning to understand game component difficulty and player skill, dynamically constructing a 2D platformer game with continually-appropriate challenge. We believe this will create a play experience that is unique because the changes are both personalized and structural, while also providing an example of a promising new research and development approach.",
      "keywords": "games, level design, dynamic difficulty adjustment, procedural content generation",
      "citation": "@inproceedings{jennings-teats2010polymorph,  title={Polymorph: Dynamic Difficulty Adjustment Through Level Generation},  author={Martin Jennings-Teats and Gillian Smith and Noah Wardrip-Fruin},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "The Use of Functional L-Systems for Scenario Generation in Serious Games",
      "year": 2010,
      "authors": "Glenn A. Martin, Charles E. Hughes, Sae Schatz, and Denise Nicholson",
      "abstract": "So called \"serious games\" have used games (in a sense, virtual environments) for reasons other than entertainment.  Particularly within the training community, they have garnered increasing attention over recent years.  However, means of generating new scenarios that have increased training effectiveness has continued to be lacking.  Because creating new scenarios is a time-intensive and costly exercise. existing scenarios are commonly reused with only minor changes, a practice that can hamper training effectiveness over time. We have been pursuing a thrust of research in automated scenario generation. In this paper, we present our work in the use of Functional L-systems for generating scenarios. We first review some of our previous work in defining scenarios; then show how Functional L-systems are used to build up the scenarios.",
      "keywords": "scenario generation, simulation, training, fl-systems.",
      "citation": "@inproceedings{martin2010the,  title={The Use of Functional L-Systems for Scenario Generation in Serious Games},  author={Glenn A. Martin and Charles E. Hughes and Sae Schatz and Denise Nicholson},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Toward Procedural Decorative Ornamentation in Games",
      "year": 2010,
      "authors": "Jim Whitehead",
      "abstract": "Castles, palaces, temples and cathedrals in the real world are densely decorated with ornamentation. Computer games, in contrast, usually have much less and appear Spartan in comparison. Game worlds, whether hand-made or procedural, require greater decorative ornamentation to increase their realism and beauty. Currently artists create this ornament by hand; this doesn't scale. In order to have more decorative artwork in games, procedural algorithms must be developed to generate it, for only this approach will create sufficient quantities, quickly, and at low cost. This paper justifies the importance of decorative ornamentation in computer games and provides an overview of existing research on algorithmic generation of patterns and ornamentation. A series of open research issues demonstrates the breadth of potential research that can be performed in this area. Together, these make the case that procedural decorative ornamentation is a new and interesting research subdomain within the area of procedural content generation for computer games.",
      "keywords": "computer generated decorative patterns, ornamentation, procedural content generation, computer games",
      "citation": "@inproceedings{whitehead2010procedural,  title={Toward Procedural Decorative Ornamentation in Games},  author={Jim Whitehead},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Towards Procedural Level Generation for Rehabilitation",
      "year": 2010,
      "authors": "Dajana Dimovska, Patrick Jarnfelt, Sebbe Selvig, and Georgios N. Yannakakis",
      "abstract": "This paper introduces the concept of procedural content generation for physical rehabilitation. In this initial study a ski-slalom game is developed on the Wii platform that procedurally places the gates of the game according to player performance. A preliminary game evaluation study is conducted on patients with injured legs and showcases the efficiency of the procedural gate generation mechanism tailoring the game difficulty to match rehabilitation goals. The study also validates certain usability aspects of the patients.",
      "keywords": "procedural level generation, wiihabilitation",
      "citation": "@inproceedings{dimovska2010procedural,  title={Towards Procedural Level Generation for Rehabilitation},  author={Dajana Dimovska and Patrick Jarnfelt and Sebbe Selvig and Georgios N. Yannakakis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Towards multiobjective procedural map generation",
      "year": 2010,
      "authors": "Julian Togelius, Mike Preuss, and Georgios N. Yannakakis",
      "abstract": "A search-based procedural content generation (SBPCG) algorithm for strategy game maps is proposed. Two representations for strategy game maps are devised, along with a number of objectives relating to predicted player experience. A multiobjective evolutionary algorithm is used for searching the space of maps for candidates that satisfy pairs of these objectives. As the objectives are inherently partially conflicting, the algorithm generates Pareto fronts showing how these objectives can be balanced. Such fronts are argued to be a valuable tool for designers looking to balance various design needs. Choosing appropriate points (manually or automatically) on the Pareto fronts, maps can be found that exhibit good map design according to specified criteria, and could either be used directly in e.g. an RTS game or form the basis for further human design.",
      "keywords": "",
      "citation": "@inproceedings{togelius2010multiobjective,  title={Towards multiobjective procedural map generation},  author={Julian Togelius and Mike Preuss and Georgios N. Yannakakis},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    },
    {
      "title": "Vectorization of Gridded Urban Land Use Data",
      "year": 2010,
      "authors": "Chris Sexton and Bejamin Watson",
      "abstract": "In the digital entertainment industry, cities are one of the largest artifacts modeled by artists. One alternative to modeling an entire city by hand is to use an urban simulation. Often, those simulations use a gridded terrain representation. Translating gridded simulation results into a more continuous, realistic representation useful in games and film can often be difficult. Our vectorization process transforms gridded urban land use data into a representation useful in entertainment pipelines and many GIS or online mapping tools. The process has three major phases. In the first phase, the raster data is analyzed and the transportation layer is abstracted and filtered. Next, the city blocks are constructed from the raster data. Third, the blocks are subdivided and land use and density are assigned to each constructed parcel. The results are much smoother than the gridded input, but maintain the land use patterns of that input. We output these results in a GIS format readable by a wide range of modeling tools.",
      "keywords": "",
      "citation": "@inproceedings{sexton2010vectorization,  title={Vectorization of Gridded Urban Land Use Data},  author={Chris Sexton and Bejamin Watson},  booktitle={Proceedings of the FDG workshop on Procedural Content Generation},  year={2010}}"
    }
  ]
}